[{"id":949,"title":"Heat","desc":"Obsessive master thief, Neil McCauley leads a top-notch crew on various insane heists throughout Los Angeles while a mentally unstable detective, Vincent Hanna pursues him without rest. Each man recognizes and respects the ability and the dedication of the other even though they are aware their cat-and-mouse game may end in violence.","genres":["Action","Crime","Drama","Thriller"],"releaseDate":{"y":1995,"m":12,"d":15},"avgRating":3.7,"tmdbImg":"jzmsMjnF39vJ3tOZHUK1g841JrS.jpg"},{"id":1408,"title":"Cutthroat Island","desc":"Morgan Adams and her slave, William Shaw, are on a quest to recover the three portions of a treasure map. Unfortunately, the final portion is held by her murderous uncle, Dawg. Her crew is skeptical of her leadership abilities, so she must complete her quest before they mutiny against her. This is made yet more difficult by the efforts of the British crown to end her pirate raids.","genres":["Action","Adventure"],"releaseDate":{"y":1995,"m":12,"d":22},"avgRating":3.8,"tmdbImg":"hYdeBZ4BFXivdouxLfQGWNE6zRx.jpg"},{"id":524,"title":"Casino","desc":"The life of the gambling paradise – Las Vegas – and its dark mafia underbelly.","genres":["Drama","Crime"],"releaseDate":{"y":1995,"m":11,"d":22},"avgRating":3.7,"tmdbImg":"4a0I37pYcdFY6HeutalHQTGs0sl.jpg"},{"id":5,"title":"Four Rooms","desc":"It's Ted the Bellhop's first night on the job...and the hotel's very unusual guests are about to place him in some outrageous predicaments. It seems that this evening's room service is serving up one unbelievable happening after another.","genres":["Crime","Comedy"],"releaseDate":{"y":1995,"m":12,"d":9},"avgRating":3.4,"tmdbImg":"uZSmxBLIuZ8gpadjAWNdA5aQDAc.jpg"},{"id":451,"title":"Leaving Las Vegas","desc":"Ben Sanderson, an alcoholic Hollywood screenwriter who lost everything because of his drinking, arrives in Las Vegas to drink himself to death. There, he meets and forms an uneasy friendship and non-interference pact with prostitute Sera.","genres":["Drama","Romance"],"releaseDate":{"y":1995,"m":10,"d":27},"avgRating":3.4,"tmdbImg":"rl5ROyXACDkiSbO6PnKK6Onnw26.jpg"},{"id":902,"title":"The City of Lost Children","desc":"A scientist in a surrealist society kidnaps children to steal their dreams, hoping that they slow his aging process.","genres":["Fantasy","Science Fiction","Adventure"],"releaseDate":{"y":1995,"m":5,"d":16},"avgRating":3.7,"tmdbImg":"68LLyfJQa7lkOfIVwOzcgg4YpJH.jpg"},{"id":63,"title":"Twelve Monkeys","desc":"In the year 2035, convict James Cole reluctantly volunteers to be sent back in time to discover the origin of a deadly virus that wiped out nearly all of the earth's population and forced the survivors into underground communities. But when Cole is mistakenly sent to 1990 instead of 1996, he's arrested and locked up in a mental hospital. There he meets psychiatrist Dr. Kathryn Railly, and patient Jeffrey Goines, the son of a famous virus expert, who may hold the key to the mysterious rogue group, the Army of the 12 Monkeys, thought to be responsible for unleashing the killer disease.","genres":["Science Fiction","Thriller","Mystery"],"releaseDate":{"y":1995,"m":12,"d":29},"avgRating":3,"tmdbImg":"v2KbGzrZdMSLcKDk9vgndGOwPo5.jpg"},{"id":2054,"title":"Mr. Holland's Opus","desc":"In 1965, passionate musician Glenn Holland takes a day job as a high school music teacher, convinced it's just a small obstacle on the road to his true calling: writing a historic opus. As the decades roll by with the composition unwritten but generations of students inspired through his teaching, Holland must redefine his life's purpose.","genres":["Music","Drama","Family"],"releaseDate":{"y":1995,"m":12,"d":29},"avgRating":2.9,"tmdbImg":"kBmwWeSN3ajnYHZ3dSybEobxEPI.jpg"},{"id":880,"title":"Antonia's Line","desc":"After World War II, Antonia and her daughter, Danielle, go back to their Dutch hometown, where Antonia's late mother has bestowed a small farm upon her. There, Antonia settles down and joins a tightly-knit but unusual community. Those around her include quirky friend Crooked Finger, would-be suitor Bas and, eventually for Antonia, a granddaughter and great-granddaughter who help create a strong family of empowered women.","genres":["Drama","Comedy"],"releaseDate":{"y":1995,"m":9,"d":12},"avgRating":2.5,"tmdbImg":"nUCVi6bBIL7LGC61nYaCqikAhIA.jpg"},{"id":2045,"title":"Unforgettable","desc":"Ray Liotta stars as a medical examiner who has been acquitted for his wife's murder but many still question his innocence. Obsessed with finding his wife's killer, a possible solution presents itself in an experimental serum designed by a neurobiology Linda Fiorentino which has the ability to transfer memories from one person to another, but not without consequences. Liotta driven to solve the case injects himself with the serum, bringing him closer and closer to finding her killer but bringing him closer to death.","genres":["Drama","Mystery","Science Fiction","Thriller"],"releaseDate":{"y":1996,"m":2,"d":23},"avgRating":3.4,"tmdbImg":"500Ne3EDn3HHpuCQWwGKR74r0cB.jpg"},{"id":688,"title":"The Bridges of Madison County","desc":"Photographer Robert Kincaid wanders into the life of housewife Francesca Johnson for four days in the 1960s.","genres":["Drama","Romance"],"releaseDate":{"y":1995,"m":5,"d":28},"avgRating":2.5,"tmdbImg":"8TfLAfIh5Qxp2J4ZjOafHYhWtDb.jpg"},{"id":414,"title":"Batman Forever","desc":"The Dark Knight of Gotham City confronts a dastardly duo: Two-Face and the Riddler. Formerly District Attorney Harvey Dent, Two-Face believes Batman caused the courtroom accident which left him disfigured on one side. And Edward Nygma, computer-genius and former employee of millionaire Bruce Wayne, is out to get the philanthropist; as The Riddler. Former circus acrobat Dick Grayson, his family killed by Two-Face, becomes Wayne's ward and Batman's new partner Robin.","genres":["Action","Crime","Fantasy"],"releaseDate":{"y":1995,"m":6,"d":16},"avgRating":2.6,"tmdbImg":"d7j6bt3EdRhP7CdRzehmNQRrwwB.jpg"},{"id":1873,"title":"Beyond Rangoon","desc":"Patricia Arquette stars as American widow Laura Bowman, a young doctor who's unwittingly drawn into political turmoil while vacationing in Burma in the late 1980s, in this fictionalized drama based on actual events. Bowman initially left San Francisco with her sister (Frances McDormand) in an attempt to escape painful memories of her husband and son's violent deaths. But her fight to escape to Thailand could prove just as harrowing.","genres":["Drama","Thriller"],"releaseDate":{"y":1995,"m":5,"d":24},"avgRating":3.8,"tmdbImg":"aVYw8aQs9599aWzoSswQvgNoCat.jpg"},{"id":8973,"title":"Lord of Illusions","desc":"During a routine case in L.A., NY private investigator Harry D'Amour stumbles over members of a fanatic cult who are preparing for the resurrection of their leader Nix, a powerful magician who was killed 13 years earlier.","genres":["Mystery","Horror","Thriller"],"releaseDate":{"y":1995,"m":8,"d":25},"avgRating":4.3,"tmdbImg":"mV3nUHTH18E0tSUFUnuyrwBMH2V.jpg"},{"id":281,"title":"Strange Days","desc":"Set in the year 1999 during the last days of the old millennium, the movie tells the story of Lenny Nero, an ex-cop who now deals with data-discs containing recorded memories and emotions. One day he receives a disc which contains the memories of a murderer killing a prostitute. Lenny investigates and is pulled deeper and deeper in a whirl of blackmail, murder and rape. Will he survive and solve the case?","genres":["Crime","Drama","Science Fiction","Thriller"],"releaseDate":{"y":1995,"m":10,"d":13},"avgRating":3.9,"tmdbImg":"rY5BrDRcYAKE0BYmmT66YG6Uy5Q.jpg"},{"id":3512,"title":"Under Siege 2: Dark Territory","desc":"A passenger train has been hijacked by an electronics expert and turned into an untraceable command center for a weapons satellite. He has planned to blow up Washington DC and only one man can stop him, former Navy SEAL Casey Ryback.","genres":["Action","Thriller"],"releaseDate":{"y":1995,"m":7,"d":13},"avgRating":3.6,"tmdbImg":"gElwFCQTbSK5hdK0PVyia547nst.jpg"},{"id":26258,"title":"Bushwhacked","desc":"A inept courier realises he has been used by criminals to deliver money. On the run from both the criminals and police, he poses as a Scout leader and leads a scout group on a hike through the mountains.","genres":["Adventure","Action","Comedy","Crime","Family"],"releaseDate":{"y":1995,"m":8,"d":4},"avgRating":4.2,"tmdbImg":"633lvR1OdQDonTUDcBIOHUS5Twh.jpg"},{"id":76,"title":"Before Sunrise","desc":"A dialogue marathon of a film, this fairytale love story of an American boy and French girl. During a day and a night together in Vienna their two hearts collide.","genres":["Drama","Romance"],"releaseDate":{"y":1995,"m":1,"d":27},"avgRating":3.4,"tmdbImg":"6KWnXYoV1htDT3TGYdFWucfTt6t.jpg"},{"id":1909,"title":"Don Juan DeMarco","desc":"John Arnold DeMarco is a man who believes he is Don Juan, the greatest lover in the world. Clad in a cape and mask, DeMarco undergoes psychiatric treatment with Dr. Jack Mickler to cure him of his apparent delusion. But the psychiatric sessions have an unexpected effect on the psychiatric staff and, most profoundly, Dr Mickler, who rekindles the romance in his complacent marriage.","genres":["Romance","Drama","Comedy"],"releaseDate":{"y":1994,"m":10,"d":1},"avgRating":3.4,"tmdbImg":"iclhT2tei2H3f9Xxw86I9etkiaX.jpg"},{"id":8984,"title":"Disclosure","desc":"A computer specialist is sued for sexual harassment by a former lover turned boss who initiated the act forcefully, which threatens both his career and his personal life.","genres":["Drama","Thriller","Crime","Mystery","Romance"],"releaseDate":{"y":1994,"m":12,"d":9},"avgRating":3.1,"tmdbImg":"m10Sx3ikuXhJomFnN3OYpkBpYEc.jpg"},{"id":4954,"title":"Drop Zone","desc":"A team of skydiving crooks led by DEA-agent-turned-bad Ty Moncrief (Busey) specialize in landing on police roofs and breaking in so their evil computer nerd can steal undercover agents' files and sell them to drug lords. Federal Marshal Pete Nessip (Snipes) lost a brother to this crew and learns skydiving with the help of tough-but-lovable instructor Jessie Crossmann (Butler) so he can track them down.","genres":["Action","Adventure","Thriller"],"releaseDate":{"y":1994,"m":12,"d":8},"avgRating":3,"tmdbImg":"bbveyfmq6pGrzKL0l4waeA2WHHp.jpg"},{"id":522,"title":"Ed Wood","desc":"The mostly true story of the legendary \"worst director of all time\", who, with the help of his strange friends, filmed countless B-movies without ever becoming famous or successful.","genres":["Comedy","Drama","History"],"releaseDate":{"y":1994,"m":9,"d":27},"avgRating":2.9,"tmdbImg":"lgSnLaDu48WskDAobYH1vntKETk.jpg"},{"id":628,"title":"Interview with the Vampire","desc":"A vampire relates his epic life story of love, betrayal, loneliness, and dark hunger to an over-curious reporter.","genres":["Horror","Romance"],"releaseDate":{"y":1994,"m":11,"d":11},"avgRating":3.9,"tmdbImg":"t7NU8IcmcNBrlunCxiycX9JV7Rp.jpg"},{"id":11,"title":"Star Wars","desc":"Princess Leia is captured and held hostage by the evil Imperial forces in their effort to take over the galactic Empire. Venturesome Luke Skywalker and dashing captain Han Solo team together with the loveable robot duo R2-D2 and C-3PO to rescue the beautiful princess and restore peace and justice in the Empire.","genres":["Adventure","Action","Science Fiction"],"releaseDate":{"y":1977,"m":5,"d":25},"avgRating":3.8,"tmdbImg":"jjV37zLlE4guejPkkhvmHqSGh4u.jpg"},{"id":1945,"title":"Nell","desc":"In a remote woodland cabin, a small town doctor discovers Nell - a beautiful young hermit woman with many secrets.","genres":["Drama","Thriller"],"releaseDate":{"y":1994,"m":12,"d":23},"avgRating":4.6,"tmdbImg":"6WZFYXMFFwNS0AmTd3deCLXjt10.jpg"},{"id":527,"title":"Once Were Warriors","desc":"A drama about a Maori family lving in Auckland, New Zealand. Lee Tamahori tells the story of Beth Heke’s strong will to keep her family together during times of unemployment and abuse from her violent and alcoholic husband.","genres":["Drama"],"releaseDate":{"y":1994,"m":9,"d":2},"avgRating":4.4,"tmdbImg":"wnlE40bahHiDd4b41gTXgORae0z.jpg"},{"id":101,"title":"Leon: The Professional","desc":"Leon, the top hit man in New York, has earned a rep as an effective \"cleaner\". But when his next-door neighbors are wiped out by a loose-cannon DEA agent, he becomes the unwilling custodian of 12-year-old Mathilda. Before long, Mathilda's thoughts turn to revenge, and she considers following in Leon's footsteps.","genres":["Thriller","Crime","Drama"],"releaseDate":{"y":1994,"m":9,"d":14},"avgRating":4.1,"tmdbImg":"bvl1LOvXlNegoa584l67W6UH2kR.jpg"},{"id":680,"title":"Pulp Fiction","desc":"A burger-loving hit man, his philosophical partner, a drug-addled gangster's moll and a washed-up boxer converge in this sprawling, comedic crime caper. Their adventures unfurl in three stories that ingeniously trip back and forth in time.","genres":["Thriller","Crime"],"releaseDate":{"y":1994,"m":9,"d":10},"avgRating":4,"tmdbImg":"d5iIlFn5s0ImszYzBPb8JPIfbXD.jpg"},{"id":110,"title":"Three Colors: Red","desc":"Red This is the third film from the trilogy by Kieślowski. “Red” meaning brotherliness. Here Kieślowski masterly tells strange coincidentally linked stories in the most packed work.","genres":["Drama","Mystery","Romance"],"releaseDate":{"y":1994,"m":5,"d":27},"avgRating":4,"tmdbImg":"5YIzZaQlwYJY5ZEqHRs9dG9DduB.jpg"},{"id":278,"title":"The Shawshank Redemption","desc":"Framed in the 1940s for the double murder of his wife and her lover, upstanding banker Andy Dufresne begins a new life at the Shawshank prison, where he puts his accounting skills to work for an amoral warden. During his long stretch in prison, Dufresne comes to be admired by the other inmates -- including an older prisoner named Red -- for his integrity and unquenchable sense of hope.","genres":["Drama","Crime"],"releaseDate":{"y":1994,"m":9,"d":23},"avgRating":3,"tmdbImg":"q6y0Go1tsGEsmtFryDOJo3dEmqu.jpg"},{"id":193,"title":"Star Trek: Generations","desc":"Captain Jean-Luc Picard and the crew of the Enterprise-D find themselves at odds with the renegade scientist Soran who is destroying entire star systems. Only one man can help Picard stop Soran's scheme...and he's been dead for seventy-eight years.","genres":["Science Fiction","Action","Adventure","Thriller"],"releaseDate":{"y":1994,"m":11,"d":17},"avgRating":2.4,"tmdbImg":"yFM2kFnWJ1ZiCmB7PlSLei1N801.jpg"},{"id":1587,"title":"What's Eating Gilbert Grape","desc":"Gilbert has to care for his brother Arnie and his obese mother, which gets in the way when love walks into his life.","genres":["Romance","Drama"],"releaseDate":{"y":1993,"m":12,"d":17},"avgRating":3.5,"tmdbImg":"8FxWgsfDNosewo7H65oE4QkOb7g.jpg"},{"id":2064,"title":"While You Were Sleeping","desc":"A love story built on a misunderstanding. A transit worker pulls commuter Peter off the tracks after he's mugged. But while he's in a coma, his family mistakenly thinks she's Peter's fiancée, and she doesn't correct them. Things get more complicated when she falls for his brother, who's not quite sure that she's who she claims to be.","genres":["Comedy","Drama","Romance"],"releaseDate":{"y":1995,"m":4,"d":21},"avgRating":4.4,"tmdbImg":"qNGO3ETcNwlWqK2kNRpbJSJRlos.jpg"},{"id":236,"title":"Muriel's Wedding","desc":"Muriel’s Wedding is P.J. Hogan’s film debut. A humorous emancipation story of an unemployed woman who evolves from a dreamer into a self sustaining successful woman. An amusing comedy that’s funny, silly, angry and serious.","genres":["Drama","Comedy","Romance"],"releaseDate":{"y":1994,"m":9,"d":29},"avgRating":3.4,"tmdbImg":"zJyTr8Fo412a2OIfJGXTRAm4IwX.jpg"},{"id":2759,"title":"The Adventures of Priscilla, Queen of the Desert","desc":"Two drag-queens and a transsexual contract to perform a drag show at a resort in Alice Springs, a resort town in the remote Australian desert. They head west from Sydney aboard their lavender bus, Priscilla. En route, it is discovered that the woman they've contracted with is the wife of one of the drag queens. Their bus breaks down, and is repaired by Bob, who travels on with them.","genres":["Drama","Comedy"],"releaseDate":{"y":1994,"m":5,"d":31},"avgRating":3.1,"tmdbImg":"2gRdAFKMnLhEehvrmrGs3PxdWqP.jpg"},{"id":13,"title":"Forrest Gump","desc":"A man with a low IQ has accomplished great things in his life and been present during significant historic events - in each case, far exceeding what anyone imagined he could do. Yet, despite all the things he has attained, his one true love eludes him. 'Forrest Gump' is the story of a man who rose above his challenges, and who proved that determination, courage, and love are more important than ability.","genres":["Comedy","Drama","Romance"],"releaseDate":{"y":1994,"m":7,"d":6},"avgRating":4.1,"tmdbImg":"zxzYh2YtgypKrijVE0OuIyEgwdT.jpg"},{"id":1689,"title":"Little Buddha","desc":"Little Buddha is a movie about the life of Siddhartha starring Keanu Reeves and Bridget Fonda and directed by Bernardo Bertolucci.","genres":["Drama","History"],"releaseDate":{"y":1993,"m":12,"d":1},"avgRating":3.3,"tmdbImg":"xy70xtdoKZ3PxlKkakwdhL3UFDQ.jpg"},{"id":2788,"title":"Reality Bites","desc":"A small circle of friends suffering from post-collegiate blues must confront the hard truth about life, love and the pursuit of gainful employment. As they struggle to map out survival guides for the future, the Gen-X quartet soon begins to realize that reality isn't all it's cracked up to be.","genres":["Drama"],"releaseDate":{"y":1994,"m":2,"d":18},"avgRating":4.2,"tmdbImg":"qGDhodtpkpxkrFqokenGNJlzt6w.jpg"},{"id":315,"title":"Faster, Pussycat! Kill! Kill!","desc":"Three strippers seeking thrills encounter a young couple in the desert. After dispatching the boyfriend, they take the girl hostage and begin scheming on a crippled old man living with his two sons in the desert, reputedly hiding a tidy sum of cash. They become house guests of the old man and try and seduce the sons in an attempt to locate the money, not realizing that the old man has a few sinister intentions of his own.","genres":["Action","Crime"],"releaseDate":{"y":1965,"m":8,"d":6},"avgRating":3,"tmdbImg":"4mld2L1vWqgqFQmKa7KU4HzLKPi.jpg"},{"id":8011,"title":"Highlander: The Final Dimension","desc":"Starts off in the 15th century, with Connor McLeod (Christopher Lambert) training with another immortal swordsman, the Japanese sorcerer Nakano (Mako). When an evil immortal named Kane (Mario Van Peebles) kills the old wizard, the resulting battle leaves him buried in an underground cave. When Kane resurfaces in the 20th century to create havoc, it's up to McLeod to stop him.","genres":["Action","Fantasy","Science Fiction"],"releaseDate":{"y":1994,"m":11,"d":29},"avgRating":3.4,"tmdbImg":"fr7cCDKkWVoS8TyuIhvzDF8dXOs.jpg"},{"id":306,"title":"Beverly Hills Cop III","desc":"Back in sunny southern California and on the trail of two murderers, Axel Foley again teams up with LA cop Billy Rosewood. Soon, they discover that an amusement park is being used as a front for a massive counterfeiting ring – and it's run by the same gang that shot Billy's boss.","genres":["Action","Comedy","Crime"],"releaseDate":{"y":1994,"m":5,"d":24},"avgRating":4.3,"tmdbImg":"szhFPC5FXN6YHGMqWuqaGR7EKk8.jpg"},{"id":178,"title":"Blown Away","desc":"Blown Away tells the story of Jimmy Dove who works for the Boston bomb squad. Shortly after Dove leaves the force his partner is killed by a bomb that Dove thinks might have been made by someone he knows.","genres":["Drama","Action","Thriller"],"releaseDate":{"y":1994,"m":7,"d":1},"avgRating":4.8,"tmdbImg":"zrLF53nrmI7ZQi6eoKDbo3cF2xt.jpg"},{"id":2124,"title":"Color of Night","desc":"When New York psychiatrist Bill Capa visits Los Angeles to take over his murdered colleague's therapy group, he finds himself embroiled in the thick of a mystery when he bumps into Rose and begins a torrid affair.","genres":["Drama","Mystery","Romance","Thriller"],"releaseDate":{"y":1994,"m":8,"d":19},"avgRating":3.4,"tmdbImg":"p2iT1Csco7Ko3Hnv6UDcXZEkp10.jpg"},{"id":2087,"title":"The Getaway","desc":"Doc McCoy is put in prison because his partners chickened out and flew off without him after exchanging a prisoner with a lot of money. Doc knows Jack Benyon, a rich \"business\"-man, is up to something big, so he tells his wife (Carol McCoy) to tell him that he's for sale if Benyon can get him out of prison. Benyon pulls some strings and Doc McCoy is released again. Unfortunately he has to cooperate with the same person that got him to prison.","genres":["Drama","Action","Thriller"],"releaseDate":{"y":1994,"m":2,"d":11},"avgRating":3.7,"tmdbImg":"pDDLZqh3ujXvdE3tOLlOVtlEP86.jpg"},{"id":2019,"title":"Hard Target","desc":"When a woman's father goes missing, she enlist a local to aid in her search.  The pair soon discover that her father has died at the hands of a wealthy sportsman who hunts homeless men as a form of recreation.","genres":["Action","Adventure","Crime","Thriller"],"releaseDate":{"y":1993,"m":8,"d":20},"avgRating":4.4,"tmdbImg":"gSCKJCbwrS1WccphIRU2By7MMLW.jpg"},{"id":2259,"title":"The House of the Spirits","desc":"A rancher, his clairvoyant wife and their family face turbulent years in South America.","genres":["Romance","Drama"],"releaseDate":{"y":1993,"m":10,"d":19},"avgRating":2.5,"tmdbImg":"q0YyNTvooXI9ZF71dAYKcRwqlGn.jpg"},{"id":6,"title":"Judgment Night","desc":"While racing to a boxing match, Frank, Mike, John and Rey get more than they bargained for. A wrong turn lands them directly in the path of Fallon, a vicious, wise-cracking drug lord. After accidentally witnessing Fallon murder a disloyal henchman, the four become his unwilling prey in a savage game of cat &amp; mouse as they are mercilessly stalked through the urban jungle in this taut suspense drama","genres":["Action","Thriller","Crime"],"releaseDate":{"y":1993,"m":10,"d":15},"avgRating":4,"tmdbImg":"rYFAvSPlQUCebayLcxyK79yvtvV.jpg"},{"id":329,"title":"Jurassic Park","desc":"A wealthy entrepreneur secretly creates a theme park featuring living dinosaurs drawn from prehistoric DNA. Before opening day, he invites a team of experts and his two eager grandchildren to experience the park and help calm anxious investors. However, the park is anything but amusing as the security systems go off-line and the dinosaurs escape.","genres":["Adventure","Science Fiction"],"releaseDate":{"y":1993,"m":6,"d":11},"avgRating":3.4,"tmdbImg":"9i3plLl89DHMz7mahksDaAo7HIS.jpg"},{"id":507,"title":"Killing Zoe","desc":"Zed (Eric Stoltz) is an American vault-cracker who travels to Paris to meet up with his old friend Eric (Jean-Hugues Anglade). Eric and his gang have planned to raid the only bank in the city which is open on Bastille day. After offering his services, Zed soon finds himself trapped in a situation beyond his control when heroin abuse, poor planning and a call-girl named Zoe all conspire to turn the robbery into a very bloody siege.","genres":["Action","Crime","Drama","Thriller"],"releaseDate":{"y":1993,"m":10,"d":1},"avgRating":3.5,"tmdbImg":"wIz2JkdEghFcRDOoxZyPfvWNjwe.jpg"},{"id":788,"title":"Mrs. Doubtfire","desc":"Loving but irresponsible dad Daniel Hillard, estranged from his exasperated spouse, is crushed by a court order allowing only weekly visits with his kids. When Daniel learns his ex needs a housekeeper, he gets the job -- disguised as an English nanny. Soon he becomes not only his children's best pal but the kind of parent he should have been from the start.","genres":["Comedy","Drama","Family"],"releaseDate":{"y":1993,"m":11,"d":24},"avgRating":3.2,"tmdbImg":"szvidvi0Fo4j2gmMtk1sNe1rkzw.jpg"},{"id":1245,"title":"The Remains of the Day","desc":"A rule bound head butler's world of manners and decorum in the household he maintains is tested by the arrival of a housekeeper who falls in love with him in post-WWI Britain. The possibility of romance and his master's cultivation of ties with the Nazi cause challenge his carefully maintained veneer of servitude.","genres":["Drama","Romance"],"releaseDate":{"y":1993,"m":11,"d":5},"avgRating":3.9,"tmdbImg":"qtwipjmSypSQuSvz5BNirSxZqbg.jpg"},{"id":7007,"title":"Rising Sun","desc":"When a prostitute is found dead in a Los Angeles skyscraper occupied by a large Japanese corporation, detectives John Conner and Web Smith are called in to investigate. Although Conner has previous experience working in Japan, cultural differences make their progress difficult until a security disc showing the murder turns up. Close scrutiny proves the disc has been doctored, and the detectives realize they're dealing with a cover-up as well.","genres":["Action","Drama","Thriller"],"releaseDate":{"y":1993,"m":7,"d":30},"avgRating":3.5,"tmdbImg":"ktW3dtnHTuexLUtIPwxpzYrGzF5.jpg"},{"id":2088,"title":"Romeo Is Bleeding","desc":"A corrupt cop gets in over his head when he tries to assassinate a beautiful Russian hit-woman.","genres":["Action","Crime","Drama","Thriller"],"releaseDate":{"y":1993,"m":9,"d":13},"avgRating":2.6,"tmdbImg":"mgCwAZBG0PCkZflC6nzsxwvG2vu.jpg"},{"id":858,"title":"Sleepless in Seattle","desc":"A young boy who tries to set his dad up on a date after the death of his mother. He calls into a radio station to talk about his dad’s loneliness which soon leads the dad into meeting a Journalist Annie who flies to Seattle to write a story about the boy and his dad. Yet Annie ends up with more than just a story in this popular romantic comedy.","genres":["Comedy","Drama","Romance"],"releaseDate":{"y":1993,"m":6,"d":24},"avgRating":4.6,"tmdbImg":"gCmUrcVr0HhLZmsk0XYcSCKKo3A.jpg"},{"id":78,"title":"Blade Runner","desc":"In the smog-choked dystopian Los Angeles of 2019, blade runner Rick Deckard is called out of retirement to terminate a quartet of replicants who have escaped to Earth seeking their creator for a way to extend their short life spans.","genres":["Science Fiction","Drama","Thriller"],"releaseDate":{"y":1982,"m":6,"d":25},"avgRating":3.2,"tmdbImg":"zHKWxyG4j404HVeSYHNH4niUpkW.jpg"},{"id":319,"title":"True Romance","desc":"Clarence marries hooker Alabama, steals cocaine from her pimp, and tries to sell it in Hollywood, while the owners of the coke try to reclaim it.","genres":["Action","Thriller","Crime","Romance"],"releaseDate":{"y":1993,"m":9,"d":9},"avgRating":4.1,"tmdbImg":"wiVWuh2zOoeayn54CEQ0ybwgYZU.jpg"},{"id":280,"title":"Terminator 2: Judgment Day","desc":"Nearly 10 years have passed since Sarah Connor was targeted for termination by a cyborg from the future. Now her son, John, the future leader of the resistance, is the target for a newer, more deadly terminator. Once again, the resistance has managed to send a protector back to attempt to save John and his mother Sarah.","genres":["Action","Thriller","Science Fiction"],"releaseDate":{"y":1991,"m":7,"d":1},"avgRating":4.1,"tmdbImg":"5M0j0B18abtBI5gi2RhfjjurTqb.jpg"},{"id":581,"title":"Dances with Wolves","desc":"Wounded Civil War soldier, John Dunbar tries to commit suicide – and becomes a hero instead. As a reward, he's assigned to his dream post, a remote junction on the Western frontier, and soon makes unlikely friends with the local Sioux tribe.","genres":["Adventure","Drama","Western"],"releaseDate":{"y":1990,"m":11,"d":9},"avgRating":4.3,"tmdbImg":"cvaBVpS0GzKqBd63pFT8f1E8OKv.jpg"},{"id":275,"title":"Fargo","desc":"Jerry, a small-town Minnesota car salesman is bursting at the seams with debt... but he's got a plan. He's going to hire two thugs to kidnap his wife in a scheme to collect a hefty ransom from his wealthy father-in-law. It's going to be a snap and nobody's going to get hurt... until people start dying. Enter Police Chief Marge, a coffee-drinking, parka-wearing - and extremely pregnant - investigator who'll stop at nothing to get her man. And if you think her small-time investigative skills will give the crooks a run for their ransom... you betcha!","genres":["Crime","Drama","Thriller"],"releaseDate":{"y":1996,"m":4,"d":5},"avgRating":2.8,"tmdbImg":"rt7cpEr1uP6RTZykBFhBTcRaKvG.jpg"},{"id":1592,"title":"Primal Fear","desc":"An arrogant, high-powered attorney takes on the case of a poor altar boy found running away from the scene of the grisly murder of the bishop who has taken him in. The case gets a lot more complex when the accused reveals that there may or may not have been a 3rd person in the room. The intensity builds when a surprise twist alters everyone's perception of the crime.","genres":["Crime","Drama","Mystery","Thriller"],"releaseDate":{"y":1996,"m":4,"d":3},"avgRating":2.9,"tmdbImg":"qJf2TzE8nRTFbFMPJNW6c8mI0KU.jpg"},{"id":2021,"title":"Jack & Sarah","desc":"Jack always lands on his feet. He lands on his feet when he marries the beautiful Sarah. He lands on his feet when he buys a luxurious new home. However, when Sarah goes into labour, he takes a tumble down the stairs and lands on his head. When he comes around he discovers he is the proud father of a baby girl, but deficient in the spouse department to the tune of 1.","genres":["Comedy","Drama","Romance"],"releaseDate":{"y":1995,"m":6,"d":2},"avgRating":3.2,"tmdbImg":"yWMj1KMfnixB35qa2IZKniHF4sn.jpg"},{"id":954,"title":"Mission: Impossible","desc":"When Ethan Hunt, the leader of a crack espionage team whose perilous operation has gone awry with no explanation, discovers that a mole has penetrated the CIA, he's surprised to learn that he's the No. 1 suspect. To clear his name, Hunt now must ferret out the real double agent and, in the process, even the score.","genres":["Adventure","Action","Thriller"],"releaseDate":{"y":1996,"m":5,"d":22},"avgRating":4.3,"tmdbImg":"lirMXnE7NoVLDr3qeqf48fR1mk4.jpg"},{"id":2300,"title":"Space Jam","desc":"In a desperate attempt to win a basketball match and earn their freedom, the Looney Tunes seek the aid of retired basketball champion, Michael Jordan.","genres":["Animation","Comedy","Drama","Family","Fantasy"],"releaseDate":{"y":1996,"m":11,"d":15},"avgRating":4.2,"tmdbImg":"6h3FIr5CQFCBV8Xrv7XZLZbIQR0.jpg"},{"id":753,"title":"Faces","desc":"An old married man leaves his wife for a younger woman. Shortly after, his ex-wife also begins a relationship with a younger partner.","genres":["Drama"],"releaseDate":{"y":1968,"m":11,"d":24},"avgRating":3.6,"tmdbImg":"qTkhxFQ0o6DEtTtPXkv4IA5M90J.jpg"},{"id":922,"title":"Dead Man","desc":"On the run after murdering a man, accountant William Blake encounters a strange North American man named Nobody who prepares him for his journey into the spiritual world.","genres":["Drama","Fantasy","Western"],"releaseDate":{"y":1995,"m":12,"d":23},"avgRating":4.4,"tmdbImg":"65iVwc0t5eTDhQJsddsR14uBuGr.jpg"},{"id":532,"title":"A Close Shave","desc":"Wallace falls in love with wool-shop owner Wendolene, not suspecting that she (or rather, her dog) is at the head of a fiendish sheep-rustling plot. Gromit is set up and jailed, but his new-found sheepish friend is determine to give Wallace a helping hand in finding out the real truth.","genres":["Family","Animation","Comedy"],"releaseDate":{"y":1995,"m":12,"d":24},"avgRating":3.4,"tmdbImg":"lIu6T05z5wMfzpsJnyiTFRx55OS.jpg"},{"id":935,"title":"Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb","desc":"Insane General Jack D. Ripper initiates a nuclear strike on the Soviet Union. As soon as the actions of General \"Buck\" Turgidson are discovered, a war room full of politicians, generals and a Russian diplomat all frantically try to stop the nuclear strike. Near the end is a scene that is probably the most uniquely unforgettable performance of Slim Pickens in his movie career. Peter Sellers plays multiple roles in this film.","genres":["Drama","Comedy","War"],"releaseDate":{"y":1964,"m":1,"d":29},"avgRating":4.2,"tmdbImg":"7SixLzxcqezkZEYU8pcHZgbkmjp.jpg"},{"id":627,"title":"Trainspotting","desc":"Renton, deeply immersed in the Edinburgh drug scene, tries to clean up and get out, despite the allure of the drugs and influence of friends.","genres":["Drama","Crime"],"releaseDate":{"y":1996,"m":2,"d":23},"avgRating":3.3,"tmdbImg":"6UTzw3kipgTYAJCX8GExoXzcVOx.jpg"},{"id":1645,"title":"A Time to Kill","desc":"A young lawyer defends a black man accused of murdering two men who raped his 10-year-old daughter, sparking a rebirth of the KKK.","genres":["Crime","Drama","Thriller"],"releaseDate":{"y":1996,"m":7,"d":24},"avgRating":3.6,"tmdbImg":"apUSR9WE7lMATBGYhzZ8RnPDYsK.jpg"},{"id":2925,"title":"The First Wives Club","desc":"After years of helping their hubbies climb the ladder of success, three mid-life Manhattanites have been dumped for a newer, curvier model. But the trio is determined to turn their pain into gain. They come up with a cleverly devious plan to hit their exes where it really hurts - in the wallet!","genres":["Comedy"],"releaseDate":{"y":1996,"m":9,"d":20},"avgRating":4.3,"tmdbImg":"2ApifgYnfdJUSmCKzTBrWOYYWsn.jpg"},{"id":549,"title":"Basquiat","desc":"Director Julian Schnabel illustrates the portrait of his friend, the first African-American Pop artist Jean-Michel Basquiat who unfortunately died at a young age and just as he was beginning to make a name for himself in the art world. Alongside the biography of Basquiat are the artists and the art scene from early 1980’s New York.","genres":["Drama","History"],"releaseDate":{"y":1996,"m":8,"d":9},"avgRating":4.3,"tmdbImg":"hNjjGGnHrLILwFiEwGESWD6QRCy.jpg"},{"id":238,"title":"The Godfather","desc":"Spanning the years 1945 to 1955, a chronicle of the fictional Italian-American Corleone crime family. When organized crime family patriarch, Vito Corleone barely survives an attempt on his life, his youngest son, Michael steps in to take care of the would-be killers, launching a campaign of bloody revenge.","genres":["Drama","Crime"],"releaseDate":{"y":1972,"m":3,"d":14},"avgRating":3,"tmdbImg":"3bhkrj58Vtu7enYsRolD1fZdja1.jpg"},{"id":159,"title":"Maybe... Maybe Not","desc":"Der Bewegte Mann is a German comedy about a heterosexual man, Axel, who is thrown out of his girlfriends home for cheating and ends up moving in with a gay man. Axel learns the advantages of living with gay men even though they are attracted to him and when his girlfriend wants him back he must make a tough decision.","genres":["Comedy","Drama"],"releaseDate":{"y":1994,"m":10,"d":5},"avgRating":4,"tmdbImg":"eZrZG5BTSkupdrpQgUkO91S3F0g.jpg"},{"id":2769,"title":"An American in Paris","desc":"Jerry Mulligan is an exuberant American expatriate in Paris trying to make a reputation as a painter. His friend Adam is a struggling concert pianist who's a long time associate of a famous French singer, Henri Baurel. A lonely society woman, Milo Roberts, takes Jerry under her wing and supports him, but is interested in more than his art.","genres":["Drama","Comedy","Music","Romance"],"releaseDate":{"y":1951,"m":8,"d":8},"avgRating":2.3,"tmdbImg":"lyDXkvG53ldz6Cf7dbjJl7TaoP5.jpg"},{"id":164,"title":"Breakfast at Tiffany's","desc":"Fortune hunter Holly Golightly finds herself captivated by aspiring writer Paul Varjak, who's moved into her building on a wealthy woman's dime. As romance blooms between Paul and Holly, Doc Golightly shows up on the scene, revealing Holly's past.","genres":["Comedy","Drama","Romance"],"releaseDate":{"y":1961,"m":10,"d":5},"avgRating":3.6,"tmdbImg":"4ZK7jjKjxUPniYtX8kyuOjVFQaS.jpg"},{"id":426,"title":"Vertigo","desc":"A retired San Francisco detective suffering from acrophobia investigates the strange activities of an old friend's wife, all the while becoming dangerously obsessed with her.","genres":["Mystery","Romance","Thriller"],"releaseDate":{"y":1958,"m":5,"d":9},"avgRating":3.2,"tmdbImg":"15uOEfqBNTVtDUT7hGBVCka0rZz.jpg"},{"id":213,"title":"North by Northwest","desc":"Advertising man Roger Thornhill is mistaken for a spy, triggering a deadly cross-country chase.","genres":["Mystery","Thriller"],"releaseDate":{"y":1959,"m":7,"d":7},"avgRating":4.2,"tmdbImg":"rzOQHh5Utbr3x0UvKIbIU5pVA0f.jpg"},{"id":239,"title":"Some Like It Hot","desc":"Two musicians witness a mob hit and struggle to find a way out of the city before they are found by the gangsters. Their only opportunity is to join an all-girl band as they leave on a tour. To make their getaway they must first disguise themselves as women, then keep their identities secret and deal with the problems this brings - such as an attractive bandmate and a very determined suitor.","genres":["Comedy","Romance"],"releaseDate":{"y":1959,"m":3,"d":18},"avgRating":3,"tmdbImg":"hVIKyTK13AvOGv7ICmJjK44DTzp.jpg"},{"id":289,"title":"Casablanca","desc":"In Casablanca, Morocco in December 1941, a cynical American expatriate meets a former lover, with unforeseen complications.","genres":["Drama","Romance"],"releaseDate":{"y":1942,"m":11,"d":26},"avgRating":3.5,"tmdbImg":"1O075iFd6uG1fFqHMSDhaD4JCm8.jpg"},{"id":6620,"title":"Sabrina","desc":"Linus and David Larrabee are the two sons of a very wealthy family. Linus is all work -- busily running the family corporate empire, he has no time for a wife and family. David is all play -- technically he is employed by the family business, but never shows up for work, spends all his time entertaining, and has been married and divorced three times. Meanwhile, Sabrina Fairchild is the young, shy, and awkward daughter of the household chauffeur, who has been infatuated with David all her life, but David hardly notices her -- \"doesn't even know I exist\" -- until she goes away to Paris for two years, and returns an elegant, sophisticated, beautiful woman. Suddenly, she finds that she has captured David's attention, but just as she does so, she finds herself falling in love with Linus, and she finds that Linus is also falling in love with her.","genres":["Comedy","Drama","Romance"],"releaseDate":{"y":1954,"m":9,"d":28},"avgRating":3.9,"tmdbImg":"mfsgfChb73lCqRqODrLmxV8hX1P.jpg"},{"id":804,"title":"Roman Holiday","desc":"Overwhelmed by her suffocating schedule, touring European princess Ann takes off for a night while in Rome. When a sedative she took from her doctor kicks in, however, she falls asleep on a park bench and is found by an American reporter, Joe Bradley, who takes her back to his apartment for safety. At work the next morning, Joe finds out Ann's regal identity and bets his editor he can get exclusive interview with her, but romance soon gets in the way.","genres":["Comedy","Romance"],"releaseDate":{"y":1953,"m":9,"d":2},"avgRating":2.9,"tmdbImg":"aIsAxkWv5EHaRn0QR18hy4ZltAN.jpg"},{"id":909,"title":"Meet Me in St. Louis","desc":"In the year before the 1904 St Louis World's Fair, the four Smith daughters learn lessons of life and love, even as they prepare for a reluctant move to New York.","genres":["Comedy","Music","Romance"],"releaseDate":{"y":1944,"m":11,"d":23},"avgRating":3.8,"tmdbImg":"aPGcAYwFGNdfkHQnuLnxNBY9AiS.jpg"},{"id":599,"title":"Sunset Boulevard","desc":"A hack screenwriter writes a screenplay for a former silent-film star who has faded into Hollywood obscurity.","genres":["Drama"],"releaseDate":{"y":1950,"m":8,"d":10},"avgRating":4.1,"tmdbImg":"bW9SwWWaubr68glIprhrfSzWzoa.jpg"},{"id":15,"title":"Citizen Kane","desc":"Newspaper magnate, Charles Foster Kane is taken from his mother as a boy and made the ward of a rich industrialist. As a result, every well-meaning, tyrannical or self-destructive move he makes for the rest of his life appears in some way to be a reaction to that deeply wounding event.","genres":["Mystery","Drama"],"releaseDate":{"y":1941,"m":4,"d":30},"avgRating":2.4,"tmdbImg":"sav0jxhqiH0bPr2vZFU0Kjt2nZL.jpg"},{"id":62,"title":"2001: A Space Odyssey","desc":"Humanity finds a mysterious object buried beneath the lunar surface and sets off to find its origins with the help of HAL 9000, the world's most advanced super computer.","genres":["Science Fiction","Mystery","Adventure"],"releaseDate":{"y":1968,"m":4,"d":10},"avgRating":3.8,"tmdbImg":"zmmYdPa8Lxx999Af9vnVP4XQ1V6.jpg"},{"id":223,"title":"Rebecca","desc":"A self-conscious bride is tormented by the memory of her husband's dead first wife.","genres":["Drama","Mystery"],"releaseDate":{"y":1940,"m":4,"d":12},"avgRating":4.1,"tmdbImg":"3Gla0nxHboX3nxQzaU4SoqOtTjh.jpg"},{"id":303,"title":"Notorious","desc":"Released shortly after the war, this classic Hitchcock film illustrates the battle between German Nazis and American spies in Rio de Janeiro where a German businessman keeps a wine cellar with uranium ore.","genres":["Thriller","Drama","Romance"],"releaseDate":{"y":1946,"m":8,"d":15},"avgRating":3.3,"tmdbImg":"4RERYb1NIQrJHYY5e8nUlYM7t2z.jpg"},{"id":4174,"title":"Spellbound","desc":"When Dr. Anthony Edwardes arrives at a Vermont mental hospital to replace the outgoing hospital director, Dr. Constance Peterson, a psychoanalyst, discovers Edwardes is actually an impostor. The man confesses that the real Dr. Edwardes is dead and fears he may have killed him, but cannot recall anything. Dr. Peterson, however is convinced his impostor is innocent of the man's murder, and joins him on a quest to unravel his amnesia through psychoanalysis.","genres":["Drama","Mystery","Thriller"],"releaseDate":{"y":1945,"m":12,"d":28},"avgRating":3.8,"tmdbImg":"qzqt6aZrCMicCZbCoKa6JNv0aJq.jpg"},{"id":381,"title":"To Catch a Thief","desc":"A delightful Hitchcock film about an ex-burglar who must catch a thief who’s been copying this style before he gets accused of the wrong crimes. His time is running out as the police are close behind him yet he finds time for a little romance of course. A classic masterpiece starring Grace Kelly and Cary Grant.","genres":["Crime","Drama","Mystery","Romance","Thriller"],"releaseDate":{"y":1955,"m":8,"d":3},"avgRating":3.2,"tmdbImg":"9UdAlTenWqxj2l5oFExkjuVHmKO.jpg"},{"id":1939,"title":"Laura","desc":"A police detective falls in love with the woman whose murder he's investigating.","genres":["Drama","Mystery"],"releaseDate":{"y":1944,"m":10,"d":11},"avgRating":4.6,"tmdbImg":"utpUn9TdBIx6x2QX91YhYzFZxg1.jpg"},{"id":3598,"title":"Lost Horizon","desc":"British diplomat Robert Conway and a small group of civilians crash land in the Himalayas, and are rescued by the people of the mysterious, Eden-like valley of Shangri-la. Protected by the mountains from the world outside, where the clouds of World War II are gathering, Shangri-la provides a seductive escape for the world-weary Conway.","genres":["Adventure","Fantasy","Drama","Mystery"],"releaseDate":{"y":1937,"m":9,"d":1},"avgRating":3.8,"tmdbImg":"jCY8uJ80xlO2ApfrsB8s2gzyiBX.jpg"},{"id":198,"title":"To Be or Not to Be","desc":"During the Nazi occupation of Poland, an acting troupe becomes embroiled in a Polish soldier's efforts to track down a German spy.","genres":["Comedy","War"],"releaseDate":{"y":1942,"m":3,"d":5},"avgRating":3.5,"tmdbImg":"dDQRpEoyjHT4fzw9cNklIvZuXYg.jpg"},{"id":3529,"title":"The Thin Man","desc":"After a four year absence, one time detective Nick Charles returns to New York with his new wife Nora and their dog, Asta. Nick re-connects with many of his old cronies, several of whom are eccentric characters, to say the least. He's also approached by Dorothy Wynant whose inventor father Clyde Wynant is suspected of murdering her step-mother. Her father had left on a planned trip some months before and she has had no contact with him. Nick isn't all that keen on resuming his former profession but egged-on by wife Nora, who thinks this all very exciting, he agrees to help out. He solves the case, announcing the identity of the killer at a dinner party for all of the suspects.","genres":["Comedy","Crime","Mystery"],"releaseDate":{"y":1934,"m":5,"d":25},"avgRating":3.7,"tmdbImg":"kVYDx3jOGS4Hbs3ykvewHmwAw9B.jpg"},{"id":3083,"title":"Mr. Smith Goes to Washington","desc":"Naive and idealistic Jefferson Smith, leader of the Boy Rangers, is appointed on a lark by the spineless governor of his state. He is reunited with the state's senior senator--presidential hopeful and childhood hero, Senator Joseph Paine. In Washington, however, Smith discovers many of the shortcomings of the political process as his earnest goal of a national boys' camp leads to a conflict with the state political boss, Jim Taylor. Taylor first tries to corrupt Smith and then later attempts to destroy Smith through a scandal.","genres":["Comedy","Drama"],"releaseDate":{"y":1939,"m":10,"d":19},"avgRating":4.2,"tmdbImg":"fLKV2I29ujduadRaeXZxnXOxorh.jpg"},{"id":900,"title":"Bringing Up Baby","desc":"David Huxley is waiting to get a bone he needs for his museum collection. Through a series of strange circumstances, he meets Susan Vance, and the duo have a series of misadventures which include a leopard called Baby.","genres":["Comedy","Romance"],"releaseDate":{"y":1938,"m":2,"d":18},"avgRating":4,"tmdbImg":"vTNNOtemaYmtx3k2NpsLMRJKEwZ.jpg"},{"id":260,"title":"The 39 Steps","desc":"While on vacation in London, Canadian Richard Hannay becomes embroiled in an international spy ring related to the mysterious \"39 steps.\" Then he meets agent Annabella Smith, who is soon killed in his apartment. He must elude the police, who are hunting him for murder, while he tries to stop Professor Jordan from sending secrets out of the country. Hannay is assisted by Pamela, an unwilling accomplice who discovers the truth.","genres":["Action","Thriller","Mystery"],"releaseDate":{"y":1935,"m":6,"d":1},"avgRating":4.3,"tmdbImg":"paI9Tmqm2cZG6xy4Tnjw3Ydjuw5.jpg"},{"id":261,"title":"Cat on a Hot Tin Roof","desc":"Brick, an alcoholic ex-football player, drinks his days away and resists the affections of his wife, Maggie. His reunion with his father, Big Daddy, who is dying of cancer, jogs a host of memories and revelations for both father and son.","genres":["Drama","Romance"],"releaseDate":{"y":1958,"m":2,"d":17},"avgRating":3.8,"tmdbImg":"vWf1AR8rC6WjGKELlmLv2VAUZJB.jpg"},{"id":2033,"title":"Infinity","desc":"Story of the early life of genius and Nobel Prize-winning physicist Richard Feynman.","genres":["Drama","Romance"],"releaseDate":{"y":1996,"m":10,"d":4},"avgRating":3.2,"tmdbImg":"45cU6BNyRGKhDQZKzVSll4eTgwh.jpg"},{"id":173,"title":"20,000 Leagues Under the Sea","desc":"A ship sent to investigate a wave of mysterious sinkings encounters the advanced submarine, the Nautilus, commanded by Captain Nemo.","genres":["Adventure","Drama","Science Fiction"],"releaseDate":{"y":1954,"m":12,"d":23},"avgRating":2.7,"tmdbImg":"h3H1uaEo831THipKE4H30shwFLS.jpg"},{"id":433,"title":"Mary Poppins","desc":"The movie combines a diverting story, songs, color and sequences of live action blended with the movements of animated figures. Mary Poppins is a kind of Super-nanny who flies in with her umbrella in response to the request of the Banks children and proceeds to put things right with the aid of her rather extraordinary magical powers before flying off again.","genres":["Comedy","Family","Fantasy"],"releaseDate":{"y":1964,"m":8,"d":27},"avgRating":2.9,"tmdbImg":"3WVWhlDdWdIAy9ZQGwIJlUjTKB.jpg"},{"id":562,"title":"Die Hard","desc":"NYPD cop, John McClane's plan to reconcile with his estranged wife is thrown for a serious loop when minutes after he arrives at her office, the entire building is overtaken by a group of terrorists. With little help from the LAPD, wisecracking McClane sets out to single-handedly rescue the hostages and bring the bad guys down.","genres":["Action","Thriller"],"releaseDate":{"y":1988,"m":7,"d":15},"avgRating":3.8,"tmdbImg":"iiCFCTOxZgagYo8o4f5QV78UT2G.jpg"},{"id":454,"title":"Romeo + Juliet","desc":"In director Baz Luhrmann's contemporary take on William Shakespeare's classic tragedy, the Montagues and Capulets have moved their ongoing feud to the sweltering suburb of Verona Beach, where Romeo and Juliet fall in love and secretly wed. Though the film is visually modern, the bard's dialogue remains.","genres":["Drama","Romance"],"releaseDate":{"y":1996,"m":10,"d":31},"avgRating":3.5,"tmdbImg":"9ibvi4wGDyq3DcxIn7ShEMoODUg.jpg"},{"id":1834,"title":"Murder, My Sweet","desc":"Detective Philip Marlowe is hired by hulking Moose Malloy to locate his old girlfriend that he lost track of while serving time in prison. With each lead he follows, Marlowe encounters lies, larceny, perjury, theft and a beautiful femme fatale. Based on Raymond Chandler's novel \"Farewell My Lovely\", which was also the film's title in the United Kingdom.","genres":["Crime","Drama","Mystery","Thriller"],"releaseDate":{"y":1944,"m":12,"d":9},"avgRating":4,"tmdbImg":"tbyzfN1AUKTvzh058L9ZcOpS9Vn.jpg"},{"id":252,"title":"Willy Wonka & the Chocolate Factory","desc":"Eccentric candy man Willy Wonka prompts a worldwide frenzy when he announces that golden tickets hidden inside five of his delicious candy bars will admit their lucky holders into his top-secret confectionary. But does Wonka have an agenda hidden amid a world of Oompa Loompas and chocolate rivers?","genres":["Family","Fantasy"],"releaseDate":{"y":1971,"m":6,"d":29},"avgRating":3.1,"tmdbImg":"6rBduDPMX1ROzoRls8NUYmWedRv.jpg"},{"id":475,"title":"Bonnie and Clyde","desc":"Bonnie and Clyde is based on the true stories of the gangster pair Bonnie Parker and Clyde Barrow who in the 1930s began robbing banks in U.S. cities until they were eventually killed. The film is a major landmark in the aesthetic movement known as the New Hollywood.","genres":["Crime","Drama"],"releaseDate":{"y":1967,"m":7,"d":18},"avgRating":4.3,"tmdbImg":"rUuC1gHGgP2q9wldHXBJC0w27PF.jpg"},{"id":521,"title":"Dial M for Murder","desc":"An ex-tennis pro carries out a plot to have his wife murdered after discovering she is having an affair, and assumes she will soon leave him for the other man anyway. When things go wrong, he improvises a new plan - to frame her for murder instead.","genres":["Crime","Mystery","Thriller"],"releaseDate":{"y":1954,"m":5,"d":29},"avgRating":3.6,"tmdbImg":"4qPIsFXLVH9feiRBpCf2XRZqK4k.jpg"},{"id":88,"title":"Dirty Dancing","desc":"Expecting the usual tedium that accompanies a summer in the Catskills with her family, 17-year-old Frances 'Baby' Houseman is surprised to find herself stepping into the shoes of a professional hoofer – and unexpectedly falling in love.","genres":["Drama","Music","Romance"],"releaseDate":{"y":1987,"m":8,"d":21},"avgRating":3,"tmdbImg":"dvEggyDTTIBDvrUNjTEa9depT0f.jpg"},{"id":500,"title":"Reservoir Dogs","desc":"A botched robbery indicates a police informant, and the pressure mounts in the aftermath at a warehouse. Crime begets violence as the survivors -- veteran Mr. White, newcomer Mr. Orange, psychopathic parolee Mr. Blonde, bickering weasel Mr. Pink and Nice Guy Eddie -- unravel.","genres":["Crime","Thriller"],"releaseDate":{"y":1992,"m":9,"d":2},"avgRating":3.6,"tmdbImg":"p61wwD0jWfgbhg9Ja9uoDZdS8YE.jpg"},{"id":2119,"title":"Days of Thunder","desc":"Talented but unproven stock car driver Cole Trickle gets a break and with the guidance of veteran Harry Hogge turns heads on the track. The young hotshot develops a rivalry with a fellow racer that threatens his career when the two smash their cars. But with the help of his doctor, Cole just might overcome his injuries-- and his fear.","genres":["Adventure"],"releaseDate":{"y":1990,"m":6,"d":27},"avgRating":3,"tmdbImg":"cE6GeExVEAwTsqOx2YWO7aEKEI8.jpg"},{"id":25750,"title":"Children of the Corn IV: The Gathering","desc":"Grace Rhodes, who is studying to be a doctor, returns to her hometown as a strange illness is afflicting the local children. The symptoms include a high fever and spasms, but even weirder is what happens the next day: All those with the illness claim they are somebody else -- then they begin murdering the grown-ups. After her sister undergoes the same sinister metamorphosis, Grace comes to believe there is some connection to an evil cult figure who may be returning from the grave.","genres":["Horror"],"releaseDate":{"y":1996,"m":10,"d":8},"avgRating":4.6,"tmdbImg":"tRjeV9AZgCXGTqyvlp7Ui55Yb3l.jpg"},{"id":1103,"title":"Escape from New York","desc":"In 1997, the island of Manhattan has been walled off and turned into a giant maximum security prison within which the country's worst criminals are left to form their own anarchic society. However, when the President of the United States crash lands on the island, the authorities turn to a former soldier and current convict, Snake Plissken, to rescue him.","genres":["Science Fiction","Action"],"releaseDate":{"y":1981,"m":5,"d":22},"avgRating":4,"tmdbImg":"yreqWiQ7IOkXWVB2Tz4LJIs7xqA.jpg"},{"id":762,"title":"Monty Python and the Holy Grail","desc":"King Arthur, accompanied by his squire, recruits his Knights of the Round Table, including Sir Bedevere the Wise, Sir Lancelot the Brave, Sir Robin the Not-Quite-So-Brave-As-Sir-Lancelot and Sir Galahad the Pure. On the way, Arthur battles the Black Knight who, despite having had all his limbs chopped off, insists he can still fight. They reach Camelot, but Arthur decides not  to enter, as \"it is a silly place\".","genres":["Adventure","Comedy","Fantasy"],"releaseDate":{"y":1975,"m":3,"d":13},"avgRating":2.6,"tmdbImg":"8AVb7tyxZRsbKJNOTJHQZl7JYWO.jpg"},{"id":531,"title":"The Wrong Trousers","desc":"Gromit finds himself being pushed out of his room and home by a new lodger who is actually a ruthless criminal (and a small penguin). The penguin is planning a robbery and needs to use Wallace and his mechanical remote controlled trousers to pull off the raid. However, Gromit is wise to the penguin and comes to the rescue.","genres":["Animation","Comedy","Family"],"releaseDate":{"y":1993,"m":12,"d":17},"avgRating":3.6,"tmdbImg":"6Mfjg4bigxdOuKm5aCFLMgv9Mkh.jpg"},{"id":892,"title":"Delicatessen","desc":"This bizarre surrealistic black comedy takes place in a small fictitious post-apocalyptic town where food is scarce and butcher Clapet has the macabre business of using human flesh to feed his customers. Yet when his daughter falls in love with his next slaughter victim things turn into chaos.","genres":["Comedy","Science Fiction","Fantasy"],"releaseDate":{"y":1991,"m":4,"d":17},"avgRating":3.9,"tmdbImg":"pKnDFrLBHh6qXW9n8IbfFOvurUU.jpg"},{"id":2469,"title":"Tie Me Up! Tie Me Down!","desc":"Recently released from a mental hospital, Ricky ties up Marina, a film star he once had sex with and keeps her hostage.","genres":["Comedy","Crime","Drama","Romance"],"releaseDate":{"y":1989,"m":12,"d":12},"avgRating":3.4,"tmdbImg":"2xCjXPl90IRx0emvBAoj3ikfB6q.jpg"},{"id":510,"title":"One Flew Over the Cuckoo's Nest","desc":"While serving time for insanity at a state mental hospital, implacable rabble-rouser, Randle Patrick McMurphy inspires his fellow patients to rebel against the authoritarian rule of head nurse, Mildred Ratched.","genres":["Drama"],"releaseDate":{"y":1975,"m":11,"d":18},"avgRating":2.4,"tmdbImg":"3jcbDmRFiQ83drXNOvRDeKHxS0C.jpg"},{"id":85,"title":"Raiders of the Lost Ark","desc":"When Dr. Indiana Jones – the tweed-suited professor who just happens to be a celebrated archaeologist – is hired by the government to locate the legendary Ark of the Covenant, he finds himself up against the entire Nazi regime.","genres":["Adventure","Action"],"releaseDate":{"y":1981,"m":6,"d":12},"avgRating":4.1,"tmdbImg":"ceG9VzoRAVGwivFU403Wc3AHRys.jpg"},{"id":68,"title":"Brazil","desc":"Low-level bureaucrat Sam Lowry escapes the monotony of his day-to-day life through a recurring daydream of himself as a virtuous hero saving a beautiful damsel. Investigating a case that led to the wrongful arrest and eventual death of an innocent man instead of wanted terrorist Harry Tuttle, he meets the woman from his daydream, and in trying to help her gets caught in a web of mistaken identities, mindless bureaucracy and lies.","genres":["Comedy","Science Fiction"],"releaseDate":{"y":1985,"m":2,"d":20},"avgRating":3.5,"tmdbImg":"d0PibPzCK4fVikjoD1PqHovbvkt.jpg"},{"id":429,"title":"The Good, the Bad and the Ugly","desc":"While the Civil War rages between the Union and the Confederacy, three men – a quiet loner, a ruthless hit man and a Mexican bandit – comb the American Southwest in search of a strongbox containing $200,000 in stolen gold.","genres":["Western"],"releaseDate":{"y":1966,"m":12,"d":23},"avgRating":2.6,"tmdbImg":"eWivEg4ugIMAd7d4uWI37b17Cgj.jpg"},{"id":947,"title":"Lawrence of Arabia","desc":"An epic about British officer T.E. Lawrence's mission to aid the Arab tribes in their revolt against the Ottoman Empire during the First World War. Lawrence becomes a flamboyant, messianic figure in the cause of Arab unity but his psychological instability threatens to undermine his achievements.","genres":["Adventure","Drama","History","War"],"releaseDate":{"y":1962,"m":12,"d":10},"avgRating":3.7,"tmdbImg":"l6pOdchQfeBe5L9OByhtW0jhFzv.jpg"},{"id":185,"title":"A Clockwork Orange","desc":"Demonic gang-leader Alex goes on the spree of rape, mugging and murder with his pack of \"droogs\". But he's a boy who also likes Beethoven's Ninth and a bit of \"the old in-out, in-out\". He later finds himself at the mercy of the state and its brainwashing experiment designed to take violence off the streets.","genres":["Science Fiction","Drama"],"releaseDate":{"y":1971,"m":12,"d":18},"avgRating":3.2,"tmdbImg":"4sHeTAp65WrSSuc05nRBKddhBxO.jpg"},{"id":595,"title":"To Kill a Mockingbird","desc":"In a small Alabama town in the 1930s, scrupulously honest and highly respected lawyer, Atticus Finch puts his career on the line when he agrees to represent Tom Robinson, a black man accused of rape. The trial and the events surrounding it are seen through the eyes of Finch's six-year-old daughter, Scout. While Robinson's trial gives the movie its momentum, there are plenty of anecdotal occurrences before and after the court date: Scout's ever-strengthening bond with older brother, Jem, her friendship with precocious young Dill Harris, her father's no-nonsense reactions to such life-and-death crises as a rampaging mad dog, and especially Scout's reactions to, and relationship with, Boo Radley, the reclusive 'village idiot' who turns out to be her salvation when she is attacked by a venomous bigot.","genres":["Crime","Drama"],"releaseDate":{"y":1962,"m":12,"d":25},"avgRating":3.8,"tmdbImg":"fqIj7oE79qbyqHv5NBjtTI7yXP7.jpg"},{"id":28,"title":"Apocalypse Now","desc":"At the height of the Vietnam war, Captain Benjamin Willard is sent on a dangerous mission that, officially, \"does not exist, nor will it ever exist.\" His goal is to locate - and eliminate - a mysterious Green Beret Colonel named Walter Kurtz, who has been leading his personal army on illegal guerrilla missions into enemy territory.","genres":["Drama","War"],"releaseDate":{"y":1979,"m":8,"d":15},"avgRating":4.1,"tmdbImg":"gQB8Y5RCMkv2zwzFHbUJX3kAhvA.jpg"},{"id":1892,"title":"Return of the Jedi","desc":"As Rebel leaders map their strategy for an all-out attack on the Emperor's newer, bigger Death Star. Han Solo remains frozen in the cavernous desert fortress of Jabba the Hutt, the most loathsome outlaw in the universe, who is also keeping Princess Leia as a slave girl. Now a master of the Force, Luke Skywalker rescues his friends, but he cannot become a true Jedi Knight until he wages his own crucial battle against Darth Vader, who has sworn to win Luke over to the dark side of the Force.","genres":["Adventure","Action","Science Fiction"],"releaseDate":{"y":1983,"m":5,"d":23},"avgRating":3.4,"tmdbImg":"mDCBQNhR6R0PVFucJl0O4Hp5klZ.jpg"},{"id":144,"title":"Wings of Desire","desc":"Wings of Desire is Wim Wender’s artistically beautiful film about the lonely and immortal life of angels during a post-war Berlin. It’s a poetic journey from the perspective of the angels of which one falls in love with a living woman and wants to become a mortal human thus giving up his heavenly life. Filmed in black and white and with a feeling of celebrating life.","genres":["Drama","Fantasy","Romance"],"releaseDate":{"y":1987,"m":1,"d":1},"avgRating":3.3,"tmdbImg":"iZQs2vUeCzvS1KfZJ6uYNCGJBBV.jpg"},{"id":1092,"title":"The Third Man","desc":"Set in postwar Vienna, Austria, \"The Third Man\" stars Joseph Cotten as Holly Martins, a writer of pulp Westerns, who arrives penniless as a guest of his childhood chum Harry Lime, only to find him dead. Martins develops a conspiracy theory after learning of a \"third man\" present at the time of Harry's death, running into interference from British officer Maj. Calloway and falling head-over-heels for Harry's grief-stricken lover, Anna.","genres":["Thriller","Mystery"],"releaseDate":{"y":1949,"m":8,"d":31},"avgRating":3.4,"tmdbImg":"rO2Fq0AZZx9obs52KJdx4mRE8p5.jpg"},{"id":348,"title":"Alien","desc":"During its return to the earth, commercial spaceship Nostromo intercepts a distress signal from a distant planet. When a three-member team of the crew discovers a chamber containing thousands of eggs on the planet, a creature inside one of the eggs attacks an explorer. The entire crew is unaware of the impending nightmare set to descend upon them when the alien parasite planted inside its unfortunate host is birthed.","genres":["Horror","Action","Thriller","Science Fiction"],"releaseDate":{"y":1979,"m":5,"d":25},"avgRating":4,"tmdbImg":"vfrQk5IPloGg1v9Rzbh2Eg3VGyM.jpg"},{"id":766,"title":"Army of Darkness","desc":"A man is accidentally transported to 1300 A.D., where he must battle an army of the dead and retrieve the Necronomicon so he can return home.","genres":["Fantasy","Horror","Comedy"],"releaseDate":{"y":1992,"m":10,"d":9},"avgRating":4.2,"tmdbImg":"mOsWtjRGABrPrqqtm0U6WQp4GVw.jpg"},{"id":175,"title":"The Big Blue","desc":"Two men answer the call of the ocean in this romantic fantasy-adventure.  Jacques (Jean-Marc Barr) and Enzo (Jean Reno) are a pair of friends who have been close since childhood, and who share a passion for the dangerous sport of free diving. Professional diver Jacques opted to follow in the footsteps of his father, who died at sea when Jacques was a boy; to the bewilderment of scientists, Jacques harbors a remarkable ability to adjust his heart rate and breathing pattern in the water, so that his vital signs more closely resemble that of dolphins than men (he even considers a school of dolphins as his extended family).  As Enzo persuades a reluctant Jacques to compete against him in a free diving contest -- determining who can dive deeper and longer without scuba gear -- Jacques meets Johana (Rosanna Arquette), a beautiful insurance investigator from America, and he finds that he must choose between his love for her and his love of the sea.","genres":["Adventure","Drama","Romance"],"releaseDate":{"y":1988,"m":5,"d":11},"avgRating":4,"tmdbImg":"rzWPuZdbFdlXVSWxNRzkxRLI5Zc.jpg"},{"id":539,"title":"Psycho","desc":"When larcenous real estate clerk Marion Crane goes on the lam with a wad of cash and hopes of starting a new life, she ends up at the notorious Bates Motel, where manager Norman Bates cares for his housebound mother. The place seems quirky, but fine… until Marion decides to take a shower.","genres":["Drama","Horror","Thriller"],"releaseDate":{"y":1960,"m":6,"d":16},"avgRating":3.5,"tmdbImg":"nR4LD4ZJg2n6LZQpcOrLFdMq0cD.jpg"},{"id":240,"title":"The Godfather: Part II","desc":"In the continuing saga of the Corleone crime family, a young Vito Corleone grows up in Sicily and in 1910s New York. In the 1950s, Michael Corleone attempts to expand the family business into Las Vegas, Hollywood and Cuba.","genres":["Drama","Crime"],"releaseDate":{"y":1974,"m":12,"d":20},"avgRating":3.4,"tmdbImg":"hek3koDUyRQk7FIhPXsa6mT2Zc3.jpg"},{"id":490,"title":"The Seventh Seal","desc":"When disillusioned Swedish knight Antonius Block returns home from the Crusades to find his country in the grips of the Black Death, he challenges Death to a chess match for his life. Tormented by the belief that God does not exist, Block sets off on a journey, meeting up with traveling players Jof and his wife, Mia, and becoming determined to evade Death long enough to commit one redemptive act while he still lives.","genres":["Fantasy","Drama"],"releaseDate":{"y":1957,"m":2,"d":16},"avgRating":3.4,"tmdbImg":"kT0MkoMaJwyyqzpW97m8SPoa64Y.jpg"},{"id":218,"title":"The Terminator","desc":"In the post-apocalyptic future, reigning tyrannical supercomputers teleport a cyborg assassin known as the \"Terminator\" back to 1984 to kill Sarah Connor, whose unborn son is destined to lead insurgents against 21st century mechanical hegemony. Meanwhile, the human-resistance movement dispatches a lone warrior to safeguard Sarah. Can he stop the virtually indestructible killing machine?","genres":["Action","Thriller","Science Fiction"],"releaseDate":{"y":1984,"m":10,"d":26},"avgRating":3.3,"tmdbImg":"qvktm0BHcnmDpul4Hz01GIazWPr.jpg"},{"id":379,"title":"Miller's Crossing","desc":"Set in 1929, a political boss and his advisor have a parting of the ways when they both fall for the same woman.","genres":["Drama","Thriller","Crime"],"releaseDate":{"y":1990,"m":9,"d":21},"avgRating":3.3,"tmdbImg":"ab3pnsTKp3BgcAFy0FgWBFBg9FL.jpg"},{"id":207,"title":"Dead Poets Society","desc":"At an elite, old-fashioned boarding school in New England, a passionate English teacher inspires his students to rebel against convention and seize the potential of every day, courting the disdain of the stern headmaster.","genres":["Drama"],"releaseDate":{"y":1989,"m":6,"d":2},"avgRating":3.4,"tmdbImg":"ai40gM7SUaGA6fthvsd87o8IQq4.jpg"},{"id":1480,"title":"Touch of Evil","desc":"Stark, perverse story of murder, kidnapping, and police corruption in Mexican border town.","genres":["Drama","Thriller","Crime"],"releaseDate":{"y":1958,"m":4,"d":23},"avgRating":3.7,"tmdbImg":"kgxSjcvrWmJXB62eCsWJJtUcDxD.jpg"},{"id":422,"title":"8½","desc":"With 8 ½ Frederico Fellini leaves a self-portrait where dreams and reality are a mix. With help from a most excellent cast and unique scenery this self reflecting film is one of his master works.","genres":["Fantasy","Drama"],"releaseDate":{"y":1963,"m":2,"d":14},"avgRating":3.8,"tmdbImg":"9wvOlM8f3obvG9tNTkpZvF0CUU1.jpg"},{"id":829,"title":"Chinatown","desc":"Private eye Jake Gittes lives off the murky moral climate of sunbaked, pre-World War II Southern California. Hired by a beautiful socialite to investigate her husband's extra-marital affair, Gittes is swept into a maelstrom of double dealings and deadly deceits, uncovering a web of personal and political scandals that come crashing together.","genres":["Crime","Drama","Mystery","Thriller"],"releaseDate":{"y":1974,"m":6,"d":20},"avgRating":1,"tmdbImg":"xW9t98UyCmxyHMBKEzEuuDMUgcG.jpg"},{"id":3090,"title":"The Treasure of the Sierra Madre","desc":"Fred C. Dobbs and Bob Curtin, both down on their luck in Tampico, Mexico in 1925, meet up with a grizzled prospector named Howard and decide to join with him in search of gold in the wilds of central Mexico. Through enormous difficulties, they eventually succeed in finding gold, but bandits, the elements, and most especially greed threaten to turn their success into disaster.","genres":["Action","Adventure","Drama","Western"],"releaseDate":{"y":1948,"m":1,"d":24},"avgRating":3.2,"tmdbImg":"qvExr87oqKHvNiFRK5VqDoZrS5D.jpg"},{"id":3063,"title":"Duck Soup","desc":"Rufus T. Firefly is named president/dictator of bankrupt Freedonia and declares war on neighboring Sylvania over the love of wealthy Mrs. Teasdale.","genres":["Comedy"],"releaseDate":{"y":1933,"m":11,"d":17},"avgRating":3.4,"tmdbImg":"31t63plEGKHhYuuCpC9bFWO9SBS.jpg"},{"id":694,"title":"The Shining","desc":"Jack Torrance accepts a caretaker job at the Overlook Hotel, where he, along with his wife Wendy and their son Danny, must live isolated from the rest of the world for the winter. But they aren't prepared for the madness that lurks within.","genres":["Horror","Thriller"],"releaseDate":{"y":1980,"m":5,"d":22},"avgRating":2.9,"tmdbImg":"p9hqo2JWhBytLxskz4FBKcP2e1k.jpg"},{"id":235,"title":"Stand by Me","desc":"After the death of a friend, a writer recounts a boyhood journey to find the body of a missing boy.","genres":["Crime","Drama"],"releaseDate":{"y":1986,"m":8,"d":22},"avgRating":4,"tmdbImg":"vz0w9BSehcqjDcJOjRaCk7fgJe7.jpg"},{"id":832,"title":"M","desc":"In this classic German thriller, Hans Beckert, a serial killer who preys on children, becomes the focus of a massive Berlin police manhunt. Beckert's heinous crimes are so repellant and disruptive to city life that he is even targeted by others in the seedy underworld network. With both cops and criminals in pursuit, the murderer soon realizes that people are on his trail, sending him into a tense, panicked attempt to escape justice.","genres":["Drama","Action","Thriller","Crime"],"releaseDate":{"y":1931,"m":5,"d":11},"avgRating":3.6,"tmdbImg":"6hg2UClwHGnBojemFrLgiF1WK8A.jpg"},{"id":765,"title":"Evil Dead II","desc":"Ash Williams and his girlfriend Linda find a log cabin in the woods with a voice recording from an archeologist who had recorded himself reciting ancient chants from “The Book of the Dead.” As they play the recording an evil power is unleashed taking over Linda’s body.","genres":["Horror","Comedy","Fantasy"],"releaseDate":{"y":1987,"m":3,"d":13},"avgRating":2.8,"tmdbImg":"b3t9SIfnsiDZasS2jVklsCMw3ZM.jpg"},{"id":105,"title":"Back to the Future","desc":"Eighties teenager Marty McFly is accidentally sent back in time to 1955, inadvertently disrupting his parents' first meeting and attracting his mother's romantic interest. Marty must repair the damage to history by rekindling his parents' romance and - with the help of his eccentric inventor friend Doc Brown - return to 1985.","genres":["Adventure","Comedy","Science Fiction","Family"],"releaseDate":{"y":1985,"m":7,"d":3},"avgRating":3.2,"tmdbImg":"ayoiQozcSUtM64nFgXpyjaixvge.jpg"},{"id":1633,"title":"Fried Green Tomatoes","desc":"Amidst her own personality crisis, southern housewife Evelyn Couch meets Ninny, an outgoing old woman who tells her the story of Idgie Threadgoode and Ruth Jamison, two young women who experienced hardships and love in Whistle Stop, Alabama in the 1920s.","genres":["Drama","Comedy"],"releaseDate":{"y":1991,"m":12,"d":27},"avgRating":3.4,"tmdbImg":"g71l1vbJwyAAYk8zKCkIQQ58qcb.jpg"},{"id":1554,"title":"Down by Law","desc":"The story of three men from completely different tracks who all meet in a Louisiana prison cell and eventually begin an awkward journey together.","genres":["Crime","Drama","Comedy"],"releaseDate":{"y":1986,"m":5,"d":1},"avgRating":3.3,"tmdbImg":"4IyxoUQ7BB5kcSd7gASe2dTyWu7.jpg"},{"id":149,"title":"Akira","desc":"Childhood friends Tetsuo and Kaneda are pulled into the post-apocalyptic underworld of Neo-Tokyo and forced to fight for their very survival. Kaneda is a bike gang leader, and Tetsuo is a member of a tough motorcycle crew who becomes involved in a covert government project called Akira. But a bloody battle ensues when Kaneda sets out to save his friend.","genres":["Science Fiction","Animation"],"releaseDate":{"y":1988,"m":7,"d":16},"avgRating":4.3,"tmdbImg":"5KlRFKKSbyCiyYpZSS3A6G5bW0K.jpg"},{"id":903,"title":"Cool Hand Luke","desc":"When petty criminal Luke Jackson is sentenced to two years in a Florida prison farm, he doesn't play by the rules of either the sadistic warden or the yard's resident heavy, Dragline, who ends up admiring the new guy's unbreakable will. Luke's bravado, even in the face of repeated stints in the prison's dreaded solitary confinement cell, \"the box,\" make him a rebel hero to his fellow convicts and a thorn in the side of the prison officers.","genres":["Crime","Drama"],"releaseDate":{"y":1967,"m":6,"d":22},"avgRating":4.3,"tmdbImg":"tcqzBmAckeDCMHNXoKLYF3ZaZRE.jpg"},{"id":3034,"title":"Young Frankenstein","desc":"A young neurosurgeon inherits the castle of his grandfather, the famous Dr. Victor von Frankenstein. In the castle he finds a funny hunchback, a pretty lab assistant and the elderly housekeeper. Young Frankenstein believes that the work of his grandfather was delusional, but when he discovers the book where the mad doctor described his reanimation experiment, he suddenly changes his mind.","genres":["Comedy","Science Fiction"],"releaseDate":{"y":1974,"m":12,"d":15},"avgRating":3.9,"tmdbImg":"tQJAWbIjvvqVKLLbIZHtwGw2HTf.jpg"},{"id":339,"title":"Night on Earth","desc":"An anthology of 5 different cab drivers in 5 American and European cities and their remarkable fares on the same eventful night.","genres":["Comedy","Drama"],"releaseDate":{"y":1991,"m":10,"d":3},"avgRating":3.6,"tmdbImg":"ktejUHCo6c8DekpOtR3uSb6oDXr.jpg"},{"id":914,"title":"The Great Dictator","desc":"Dictator Adenoid Hynkel tries to expand his empire while a poor Jewish barber tries to avoid persecution from Hynkel's regime.","genres":["Comedy"],"releaseDate":{"y":1940,"m":10,"d":15},"avgRating":3.8,"tmdbImg":"1QpO9wo7JWecZ4NiBuu625FiY1j.jpg"},{"id":288,"title":"High Noon","desc":"High Noon is about a recently freed leader of a gang of bandits in the desert who is looking to get revenge on the Sheriff who put him in jail. A legendary western film from the Austrian director Fred Zinnemann.","genres":["Western"],"releaseDate":{"y":1952,"m":3,"d":27},"avgRating":3.4,"tmdbImg":"qETSMQ4IXBSAS409Z9OL0ppXWTW.jpg"},{"id":910,"title":"The Big Sleep","desc":"Private Detective Philip Marlowe is hired by a rich family. Before the complex case is over, he's seen murder, blackmail, and what might be love.","genres":["Crime","Drama","Mystery","Thriller"],"releaseDate":{"y":1946,"m":8,"d":23},"avgRating":4,"tmdbImg":"pZUBI77RMu652QmtWL9RBWF1uO6.jpg"},{"id":2640,"title":"Heathers","desc":"A girl who halfheartedly tries to be part of the \"in crowd\" of her school meets a rebel who teaches her a more devious way to play social politics: by killing the popular kids.","genres":["Thriller","Comedy","Drama"],"releaseDate":{"y":1988,"m":10,"d":1},"avgRating":3.5,"tmdbImg":"rtzcrwgsuESV2adSDhIuLyQoZmp.jpg"},{"id":665,"title":"Ben-Hur","desc":"Ben-Hur is a 1959 epic film directed by William Wyler, the third film version of Civil War vet Lew Wallace's 1880 novel Ben-Hur: A Tale of the Christ. It premiered at Loew's State Theatre in New York City on November 18, 1959. The movie's reputation as a classic is primarily based on two spectacular action sequences:  the great chariot race and a Roman naval battle, along with lavish production values and strong performances.  The plot of Ben Hur revolves around a Jewish prince who is betrayed and sent into slavery by a Roman friend and how he regains his freedom and comes back for revenge. However, instead he finds redemption in Christ, the theme is ultimately about being saved in the Christian sense.  The film went on to win a record of eleven Academy Awards, including Best Picture and Best Actor (Charlton Heston as Ben Hur). This record-setting Oscars sweep has since been equaled by Titanic in 1998 and The Lord of the Rings: The Return of the King in 2004, but never broken.","genres":["Action","Adventure","Drama","History"],"releaseDate":{"y":1959,"m":12,"d":26},"avgRating":3.4,"tmdbImg":"m4WQ1dBIrEIHZNCoAjdpxwSKWyH.jpg"},{"id":89,"title":"Indiana Jones and the Last Crusade","desc":"When Dr. Henry Jones Sr. suddenly goes missing while pursuing the Holy Grail, eminent archaeologist Indiana must team up with Marcus Brody, Sallah and Elsa Schneider to follow in his father's footsteps and stop the Nazis from recovering the power of eternal life.","genres":["Adventure","Action"],"releaseDate":{"y":1989,"m":5,"d":24},"avgRating":3.5,"tmdbImg":"sizg1AU8f8JDZX4QIgE4pjUMBvx.jpg"},{"id":783,"title":"Gandhi","desc":"In the early years of the 20th century, Mohandas K. Gandhi, a British-trained lawyer, forsakes all worldly possessions to take up the cause of Indian independence. Faced with armed resistance from the British government, Gandhi adopts a policy of 'passive resistance', endeavouring to win freedom for his people without resorting to bloodshed.","genres":["Drama","History"],"releaseDate":{"y":1982,"m":11,"d":30},"avgRating":3.5,"tmdbImg":"wo5Ed3Yhejts5FIG48CA2gsWPoN.jpg"},{"id":830,"title":"Forbidden Planet","desc":"Captain Adams and the crew of the Starship C57D fly towards planet Altair 4 in search for the Bellerphon spaceship that has been missing for twenty years. To their surprise they are already being expected. A classic science fiction film from 1957 starring Leslie Nielsen.","genres":["Adventure","Science Fiction","Action"],"releaseDate":{"y":1956,"m":3,"d":15},"avgRating":3.2,"tmdbImg":"faWaEdEC6EbBL7M0PbUISbxTM1j.jpg"},{"id":639,"title":"When Harry Met Sally...","desc":"During their travels from Chicago to New York, Harry and Sally Will debate whether or not sex ruins a perfect relationship between a man and a woman. Eleven years and later, they're still no closer to finding the answer.","genres":["Comedy","Romance","Drama"],"releaseDate":{"y":1989,"m":7,"d":21},"avgRating":3.2,"tmdbImg":"dzlV8hjNj9Cxjq2GI3hBTjR4hpn.jpg"},{"id":229,"title":"Bride of Frankenstein","desc":"Bride of Frankenstein begins where James Whale's Frankenstein from 1931 ended. Dr. Frankenstein has not been killed as previously portrayed and now he wants to get away from the mad experiments. Yet when his wife is kidnapped by his creation, Frankenstein agrees to help him create a new monster, this time a woman.","genres":["Horror","Science Fiction"],"releaseDate":{"y":1935,"m":4,"d":21},"avgRating":4.1,"tmdbImg":"5241zUwe7rC17MNc2QpCBKKdp1N.jpg"},{"id":377,"title":"A Nightmare on Elm Street","desc":"Teenagers in a small town are dropping like flies, apparently in the grip of mass hysteria causing their suicides. A cop's daughter, Nancy Thompson (Heather Langenkamp) traces the cause to child molester Fred Krueger (Robert Englund), who was burned alive by angry parents many years before. Krueger has now come back in the dreams of his killers' children, claiming their lives as his revenge. Nancy and her boyfriend, Glen (Johnny Depp), must devise a plan to lure the monster out of the realm of nightmares and into the real world...","genres":["Horror"],"releaseDate":{"y":1984,"m":11,"d":14},"avgRating":3.7,"tmdbImg":"wGTpGGRMZmyFCcrY2YoxVTIBlli.jpg"},{"id":653,"title":"Nosferatu","desc":"Vampire Count Orlok is interested in a new residence and in real estate agent Hutter's young wife. Silent horror classic based on the Bram Stoker novel \"Dracula\".","genres":["Fantasy","Horror"],"releaseDate":{"y":1922,"m":3,"d":15},"avgRating":3.2,"tmdbImg":"zx24O7VAs6NbJhiIrUhWysAiHS0.jpg"},{"id":145,"title":"Breaking the Waves","desc":"In a small and conservative Scottish village, a woman's paralytic husband convinces her to have extramarital intercourse so she can tell him about it and give him a reason for living.","genres":["Drama","Romance"],"releaseDate":{"y":1996,"m":5,"d":13},"avgRating":3.4,"tmdbImg":"dQWMcdHXUOSHtr7ypOCa5T79JMS.jpg"},{"id":1573,"title":"Die Hard 2","desc":"John McClane is an off-duty cop gripped with a feeling of déjà vu when on a snowy Christmas Eve in the nation's capital, terrorists seize a major international airport, holding thousands of holiday travelers hostage. Renegade military commandos led by a murderous rogue officer plot to rescue a drug lord from justice and are prepared for every contingency except one: McClane's smart-mouthed heroics.","genres":["Action","Thriller"],"releaseDate":{"y":1990,"m":7,"d":2},"avgRating":3.6,"tmdbImg":"yK1JNuFOBBzAdP7WB8SNtROjd85.jpg"},{"id":172,"title":"Star Trek V: The Final Frontier","desc":"Capt. Kirk and his crew must deal with Mr. Spock's half brother who kidnaps three diplomats and hijacks the Enterprise in his obsessive search for God.","genres":["Science Fiction","Action","Adventure","Thriller"],"releaseDate":{"y":1989,"m":6,"d":9},"avgRating":2.7,"tmdbImg":"71YocT3lTRVpippznEMThfFoQcx.jpg"},{"id":154,"title":"Star Trek II: The Wrath of Khan","desc":"Admiral James T. Kirk is feeling old; the prospect of accompanying his old ship the Enterprise on a two week cadet cruise is not making him feel any younger. But the training cruise becomes a a life or death struggle when Khan escapes from years of exile and captures the power of creation itself.","genres":["Action","Adventure","Science Fiction","Thriller"],"releaseDate":{"y":1982,"m":6,"d":3},"avgRating":3.8,"tmdbImg":"53J4DyS0wMp5r3XYJvzUh9cf0Hz.jpg"},{"id":157,"title":"Star Trek III: The Search for Spock","desc":"Admiral Kirk and his bridge crew risk their careers stealing the decommissioned Enterprise to return to the restricted Genesis planet to recover Spock's body.","genres":["Science Fiction","Action","Adventure","Thriller"],"releaseDate":{"y":1984,"m":5,"d":31},"avgRating":2.4,"tmdbImg":"eTdeYHxxeYNXPbit62ng9HXe1h5.jpg"},{"id":168,"title":"Star Trek IV: The Voyage Home","desc":"Fugitives of the Federation for their daring rescue of Spock from the doomed Genesis Planet, Admiral Kirk (William Shatner) and his crew begin their journey home to face justice for their actions. But as they near Earth, they find it at the mercy of a mysterious alien presence whose signals are slowly destroying the planet. In a desperate attempt to answer the call of the probe, Kirk and his crew race back to the late twentieth century. However they soon find the world they once knew to be more alien than anything they've encountered in the far reaches of the galaxy!","genres":["Science Fiction","Adventure"],"releaseDate":{"y":1986,"m":11,"d":25},"avgRating":3.2,"tmdbImg":"9bjUUgrdmUzed0rP1FYT0ycfXue.jpg"},{"id":364,"title":"Batman Returns","desc":"Having defeated the Joker, Batman now faces the Penguin - a warped and deformed individual who is intent on being accepted into Gotham society. Crooked businessman Max Schreck is coerced into helping him become Mayor of Gotham and they both attempt to expose Batman in a different light. Selina Kyle, Max's secretary, is thrown from the top of a building and is transformed into Catwoman - a mysterious figure who has the same personality disorder as Batman. Batman must attempt to clear his name, all the time deciding just what must be done with the Catwoman.","genres":["Action","Fantasy"],"releaseDate":{"y":1992,"m":6,"d":19},"avgRating":3.9,"tmdbImg":"aExqFVyVwqKClvnMxy6ujaFOHM7.jpg"},{"id":378,"title":"Raising Arizona","desc":"The Coen Brothers tell the story of a absurd yet likable family with an unproductive couple as the focal point. The couple has gotten themselves into some trouble while kidnapping a baby and give Hollywood one of the most memorable chase scenes to date.","genres":["Comedy","Crime"],"releaseDate":{"y":1987,"m":3,"d":1},"avgRating":3.3,"tmdbImg":"m5Zp4K4hKdPhsBl3E0p8I7QomlT.jpg"},{"id":2322,"title":"Sneakers","desc":"When shadowy U.S. intelligence agents blackmail a reformed computer hacker and his eccentric team of security experts into stealing a code-breaking 'black box' from a Soviet-funded genius, they uncover a bigger conspiracy. Now, he and his 'sneakers' must save themselves and the world economy by retrieving the box from their blackmailers.","genres":["Comedy","Crime","Drama"],"releaseDate":{"y":1992,"m":9,"d":9},"avgRating":3.1,"tmdbImg":"l2pIGwCvpZEpBuMb55YBl6A04Jv.jpg"},{"id":3179,"title":"Beavis and Butt-Head Do America","desc":"Mike Judge's slacker duo, Beavis and Butt-Head, wake to discover their TV has been stolen. Their search for a new one takes them on a clueless adventure across America where they manage to accidentally become America's most wanted.","genres":["Animation","Comedy"],"releaseDate":{"y":1996,"m":12,"d":15},"avgRating":3.3,"tmdbImg":"wEB1GPT7mQcTNuYT73s72ljjbMF.jpg"},{"id":4232,"title":"Scream","desc":"A killer known as Ghostface begins killing off teenagers, and as the body count begins rising, one girl and her friends find themselves contemplating the 'rules' of horror films as they find themselves living in a real-life one.","genres":["Crime","Horror","Mystery"],"releaseDate":{"y":1996,"m":12,"d":20},"avgRating":3,"tmdbImg":"aXAByjBN8UhaYvotqRCwa5MsMGu.jpg"},{"id":8860,"title":"Metro","desc":"Roper, a hostage negotiator catches a murderous bank robber after a blown heist. The bank robber escapes and immediately goes after the man who put him behind bars.","genres":["Action","Adventure","Comedy","Crime","Thriller"],"releaseDate":{"y":1997,"m":1,"d":16},"avgRating":2.6,"tmdbImg":"3XUufTAcu9ZIItHQYguIyxYJizx.jpg"},{"id":784,"title":"Kolya","desc":"The Czech Republic Director Jan Sverák tells in this Oscar winning film the story of the disillusioned Prague man named Cellisten Louka, who after a fictitious marriage with a Russian emigrant must suddenly take responsibility for her son. However it’s not long before the communication barrier is broken between the two new family members.","genres":["Music","Drama","Comedy"],"releaseDate":{"y":1996,"m":5,"d":5},"avgRating":2.7,"tmdbImg":"fB0cGiEOngfsfyDHXIpFOmEwFgi.jpg"},{"id":1968,"title":"Fools Rush In","desc":"Alex Whitman (Matthew Perry) is a designer from New York City who is sent to Las Vegas to supervise the construction of a nightclub that his firm has been hired to build. Alex is a straight-laced WASP-ish type who, while enjoying a night on the town, meets Isabel Fuentes (Salma Hayek), a free-spirited Mexican-American photographer. Alex and Isabel are overtaken by lust at first sight and end up sp","genres":["Drama","Comedy","Romance"],"releaseDate":{"y":1997,"m":2,"d":14},"avgRating":4.1,"tmdbImg":"tcRaMjWoF8K7h1LqOH7FOOLRQ3e.jpg"},{"id":66,"title":"Absolute Power","desc":"A master thief coincidentally is robbing a house where a murder in which the President of The United States is involved occurs in front of his eyes. He is forced to run yet may hold evidence that could convict the President. A political thriller from and starring Clint Eastwood and based on a novel by David Baldacci.","genres":["Crime","Drama","Thriller"],"releaseDate":{"y":1997,"m":2,"d":14},"avgRating":2,"tmdbImg":"nbywpfxygSRcsbmNDF6U7M8NXkl.jpg"},{"id":2163,"title":"Breakdown","desc":"When his SUV breaks down on a remote Southwestern road, Jeff Taylor lets his wife, Amy, hitch a ride with a trucker to get help. When she doesn't return, Jeff fixes his SUV and tracks down the trucker -- who tells the police he's never seen Amy. Johnathan Mostow's tense thriller then follows Jeff's desperate search for his wife, which eventually uncovers a small town's murderous secret.","genres":["Drama","Action","Thriller"],"releaseDate":{"y":1997,"m":5,"d":2},"avgRating":3.2,"tmdbImg":"zdORR3mdBgaZfFNFHyZDggB3RFl.jpg"},{"id":18,"title":"The Fifth Element","desc":"In 2257, a taxi driver is unintentionally given the task of saving a young girl who is part of the key that will ensure the survival of humanity.","genres":["Adventure","Fantasy","Action","Thriller","Science Fiction"],"releaseDate":{"y":1997,"m":5,"d":7},"avgRating":3.4,"tmdbImg":"fPtlCO1yQtnoLHOwKtWz7db6RGU.jpg"},{"id":2058,"title":"Addicted to Love","desc":"Good-natured astronomer Sam is devastated when the love of his life, Linda, leaves him for a suave Frenchman named Anton. He therefore does what every other normal dumpee would do; go to New York and set up home in the abandoned building opposite his ex-girlfriend's apartment, intent on winning her back and waiting until she decides to leave her current lover.","genres":["Comedy","Romance"],"releaseDate":{"y":1997,"m":5,"d":23},"avgRating":3.8,"tmdbImg":"sRfuSc6E9GvVaOHdPv4vG3ywfMw.jpg"},{"id":330,"title":"The Lost World: Jurassic Park","desc":"Four years after Jurassic Park's genetically bred dinosaurs ran amok, multimillionaire John Hammond shocks chaos theorist Ian Malcolm by revealing that Hammond has been breeding more beasties at a secret location. Malcolm, his paleontologist ladylove and a wildlife videographer join an expedition to document the lethal lizards' natural behavior in this action-packed thriller.","genres":["Adventure","Action","Science Fiction"],"releaseDate":{"y":1997,"m":5,"d":23},"avgRating":2.7,"tmdbImg":"yO75s9Fx2yv4GNIOsjYCHI5wBr2.jpg"},{"id":33660,"title":"Shiloh","desc":"An abused beagle runs away from his owner. On the road, he meets young Marty Preston and follows him home. The boy immediately forms a bond with the dog and names him Shiloh. His stern father won't let him keep the dog because it belongs to Judd Travers, a local hunter. After Shiloh is mistreated again, he runs away and returns to Marty. Knowing his father will once again make him bring Shiloh back to Judd, he makes a home for the dog in an old shed up the hill from the Prestons' house and hides him from his family. His secret is soon discovered when a stray attacks the dog one night and he must turn to his father for help.","genres":["Drama","Family"],"releaseDate":{"y":1996,"m":11,"d":30},"avgRating":3.8,"tmdbImg":"rcgucx2QaFnqlIVLTQUSfi0js4r.jpg"},{"id":1701,"title":"Con Air","desc":"When the government puts all its rotten criminal eggs in one airborne basket, it's asking for trouble. Before you can say, \"Pass the barf bag,\" the crooks control the plane, led by creepy Cyrus \"The Virus\" Grissom. Watching his every move is the just-released Cameron Poe, who'd rather reunite with his family.","genres":["Action","Thriller","Crime"],"releaseDate":{"y":1997,"m":6,"d":1},"avgRating":3.5,"tmdbImg":"iCjMrihDhuMh0tvqnOHPM2G4Cm4.jpg"},{"id":1639,"title":"Speed 2: Cruise Control","desc":"Sandra Bullock and Jason Patric star as a young couple whose dream cruise turns to terror when a lunatic computer genius (Willem Dafoe) sets a new course for destruction.","genres":["Action","Adventure","Thriller"],"releaseDate":{"y":1997,"m":6,"d":13},"avgRating":3.7,"tmdbImg":"jhSP3l64ANL3X7uBhsIG1eT2NWW.jpg"},{"id":415,"title":"Batman & Robin","desc":"Along with crime-fighting partner Robin and new recruit Batgirl, Batman battles the dual threat of frosty genius Mr. Freeze and homicidal horticulturalist Poison Ivy. Freeze plans to put Gotham City on ice, while Ivy tries to drive a wedge between the dynamic duo.","genres":["Action","Crime","Fantasy"],"releaseDate":{"y":1997,"m":6,"d":20},"avgRating":2.9,"tmdbImg":"gJAvyXHdIjeKHS07Dlim7LETBEK.jpg"},{"id":8874,"title":"My Best Friend's Wedding","desc":"When she receives word that her longtime platonic pal Michael O'Neal is getting married to debutante Kimberly Wallace, food critic Julianne Potter realizes her true feelings for Michael -- and sets out to sabotage the wedding.","genres":["Comedy","Romance"],"releaseDate":{"y":1997,"m":6,"d":19},"avgRating":4.1,"tmdbImg":"ksS2KAi12DsPhbY0MbRRFbcYtgs.jpg"},{"id":266,"title":"Contempt","desc":"Screenwriter Paul Javal's marriage to his wife Camille disintegrates during a film production as she spends time with its producer.","genres":["Drama"],"releaseDate":{"y":1963,"m":10,"d":21},"avgRating":3.5,"tmdbImg":"aQUDdxuWQvXMGzZw0VmvGYrPtk9.jpg"},{"id":2142,"title":"Cop Land","desc":"Freddy Heflin is the sheriff of a place everyone calls “Cop Land” — a small and seemingly peaceful town populated by the big city police officers he’s long admired. Yet something ugly is taking place behind the town’s peaceful facade. And when Freddy uncovers a massive, deadly conspiracy among these local residents, he is forced to take action and make a dangerous choice between protecting his idols and upholding the law.","genres":["Action","Crime","Drama"],"releaseDate":{"y":1997,"m":8,"d":15},"avgRating":3.3,"tmdbImg":"zp2vxJVMkSSyoaF4vX6P9pLLtt0.jpg"},{"id":468,"title":"My Own Private Idaho","desc":"In this loose adaptation of Shakespeare's \"Henry IV,\" Mike Waters (River Phoenix) is a gay hustler afflicted with narcolepsy. Scott Favor (Keanu Reeves) is the rebellious son of a mayor. Together, the two travel from Portland, Oregon to Idaho and finally to the coast of Italy in a quest to find Mike's estranged mother. Along the way they turn tricks for money and drugs, eventually attracting the attention of a wealthy benefactor and sexual deviant.","genres":["Drama","Romance"],"releaseDate":{"y":1991,"m":10,"d":17},"avgRating":3.3,"tmdbImg":"uJY5RGgU1DMTpxFjJ4ccaUzJH2C.jpg"},{"id":2118,"title":"L.A. Confidential","desc":"Three detectives in the corrupt and brutal L.A. police force of the 1950s use differing methods to uncover a conspiracy behind the shotgun slayings of the patrons at an all-night diner.","genres":["Crime","Drama","Mystery","Thriller"],"releaseDate":{"y":1997,"m":9,"d":19},"avgRating":3.8,"tmdbImg":"6w1tl5bvnMVc8qenSwqUPFF4MKr.jpg"},{"id":2255,"title":"Chasing Amy","desc":"Holden and Banky are comic book artists. Everything is going good for them until they meet Alyssa, also a comic book artist. Holden falls for her, but his hopes are crushed when he finds out she's a lesbian.","genres":["Comedy","Drama","Romance"],"releaseDate":{"y":1997,"m":4,"d":4},"avgRating":2.4,"tmdbImg":"eFhPqkNmRDfRHyQiUzUdoQjpwgh.jpg"},{"id":782,"title":"Gattaca","desc":"Science fiction drama about a future society in the era of indefinite eugenics where humans are set on a life course depending on their DNA. The young Vincent Freeman is born with a condition that would prevent him from space travel, yet he is determined to infiltrate the GATTACA space program.","genres":["Thriller","Science Fiction","Mystery","Romance"],"releaseDate":{"y":1997,"m":9,"d":7},"avgRating":3.3,"tmdbImg":"eSKr5Fl1MEC7zpAXaLWBWSBjgJq.jpg"},{"id":1959,"title":"Swept from the Sea","desc":"The film tells the story of Russian emigree and the only survivor from ship crash Yanko Goorall and servant Amy Foster in the end of 19th century. When Yanko enters a farm sick and hungry after the shipwreck, everyone is afraid of him, except for Amy, who is very kind and helps him. Soon he becomes like a son for Dr. James Kennedy and romance between Yanko and Amy follows.","genres":["Drama","Romance"],"releaseDate":{"y":1998,"m":1,"d":23},"avgRating":3.9,"tmdbImg":"w5Or62J6mF099MQcn0Cq8ycIfqB.jpg"},{"id":1281,"title":"Bean","desc":"Bean works as a caretaker at Britain's formidable Royal National Gallery, and his bosses want to fire him because he sleeps at work all the time, but can't because the chairman of the gallery's board defends him. They send him to USA, to the small Los Angeles art gallery instead, where he'll have to officiate at the opening of the greatest US picture ever (called \"Whistler's Mother\").","genres":["Comedy"],"releaseDate":{"y":1997,"m":7,"d":3},"avgRating":4.1,"tmdbImg":"1yl4sf0TqDZyCBl7QXYjLaSfmpT.jpg"},{"id":4995,"title":"Boogie Nights","desc":"Set in 1977, back when sex was safe, pleasure was a business and business was booming, idealistic porn producer Jack Horner aspires to elevate his craft to an art form. Horner discovers Eddie Adams, a hot young talent working as a busboy in a nightclub, and welcomes him into the extended family of movie-makers, misfits and hangers-on that are always around. Adams' rise from nobody to a celebrity adult entertainer is meteoric, and soon the whole world seems to know his porn alter ego, \"Dirk Diggler\". Now, when disco and drugs are in vogue, fashion is in flux and the party never seems to stop, Adams' dreams of turning sex into stardom are about to collide with cold, hard reality.","genres":["Drama"],"releaseDate":{"y":1997,"m":9,"d":11},"avgRating":4.2,"tmdbImg":"wnE24UPCPQsQnbBOu4zVE2qaDNm.jpg"},{"id":2639,"title":"Deconstructing Harry","desc":"This film tells the story of a successful writer called Harry Block, played by Allen himself, who draws inspiration from people he knows in real-life, and from events that happened to him, sometimes causing these people to become alienated from him as a result.","genres":["Comedy","Drama"],"releaseDate":{"y":1997,"m":8,"d":26},"avgRating":3.4,"tmdbImg":"rz0cls8nhbzIvcbntaICJDEnywl.jpg"},{"id":489,"title":"Good Will Hunting","desc":"Will Hunting has a genius-level IQ but chooses to work as a janitor at MIT. When he solves a difficult graduate-level math problem, his talents are discovered by Professor Gerald Lambeau, who decides to help the misguided youth reach his potential. When Will is arrested for attacking a police officer, Professor Lambeau makes a deal to get leniency for him if he will get treatment from therapist Sean Maguire.","genres":["Drama"],"releaseDate":{"y":1997,"m":12,"d":5},"avgRating":2.7,"tmdbImg":"AlXkMIEjvk2Npc15zyL0r3P4HBH.jpg"},{"id":6283,"title":"MouseHunt","desc":"Down-on-their luck brothers, Lars and Ernie Smuntz, aren't happy with the crumbling old mansion they inherit... until they discover the estate is worth millions. Before they can cash in, they have to rid the house of it's single, stubborn occupant: a tiny and tenacious mouse.","genres":["Comedy","Family"],"releaseDate":{"y":1997,"m":12,"d":19},"avgRating":3.9,"tmdbImg":"zLu2FGIf8tBFNaOpHPPygwKGTxk.jpg"},{"id":597,"title":"Titanic","desc":"84 years later, a 101-year-old woman named Rose DeWitt Bukater tells the story to her granddaughter Lizzy Calvert, Brock Lovett, Lewis Bodine, Bobby Buell and Anatoly Mikailavich on the Keldysh about her life set in April 10th 1912, on a ship called Titanic when young Rose boards the departing ship with the upper-class passengers and her mother, Ruth DeWitt Bukater, and her fiancé, Caledon Hockley. Meanwhile, a drifter and artist named Jack Dawson and his best friend Fabrizio De Rossi win third-class tickets to the ship in a game. And she explains the whole story from departure until the death of Titanic on its first and last voyage April 15th, 1912 at 2:20 in the morning.","genres":["Drama","Romance","Thriller"],"releaseDate":{"y":1997,"m":11,"d":18},"avgRating":3.5,"tmdbImg":"9xjZS2rlVxm8SFx8kPC3aIGCOYQ.jpg"}]